haskell/Functions.org
#+INCLUDE: ../theme/style.org
#+TITLE: Functions 

* Functions
** Creating functions

In the GHCI Shell

#+BEGIN_SRC haskell

> let f x y = sqrt ( x^2 + y^2 )
> 
> f 80 60
100.0
> f 50 30
58.309518948453004
> 

> :t f
f :: Floating a => a -> a -> a

> putStrLn "Hello World"
Hello World
> 


#+END_SRC

In a Haskell source file, functions.hs

#+BEGIN_SRC haskell

{- Triangle Area as function of sides -}
triangleArea a b c =  sqrt(p * (p - a) * ( p - b) * (p - c))
    where 
    p = (a + b + c) / 2.0

triangleArea2 a b c =  sqrt(p * pa * pb  *  pc)
    where 
    pa = p - a
    pb = p - b
    pc = p - c
    p = (a + b + c) / 2.0
    

triangleArea3 a b c =  let pa = p - a
                           pb = p - b
                           pc = p - c
                           p = (a + b + c) / 2.0
                           in sqrt(p * pa * pb  *  pc)

{- Returning more than one value -}    
areaAndPerimiter a b c =  (2.0 * p, sqrt(p * (p - a) * ( p - b) * (p - c)))
    where 
    p = (a + b + c) / 2.0

    
ft 0 = 10
ft 1 = 30
ft 2 = 50
ft 3 = 8
ft _ = error "Invalid Value"

{- Distance between two points in a plane -}
distance (x1, y1) (x2, y2) = sqrt ((x2 - x1)^2 + (y2 - y1)^2)
#+END_SRC

Loading functions.hs

#+BEGIN_SRC haskell
> :l functions.hs
[1 of 1] Compiling Main             ( /tmp/functions.hs, interpreted )
Ok, modules loaded: Main.
> 
> :t triangleArea 
triangleArea :: Floating a => a -> a -> a -> a

> triangleArea 24.0 30.0 18.0
216.0
> 
> triangleArea2 24.0 30.0 18.0
216.0
> 
> triangleArea3 24.0 30.0 18.0
216.0
> 

> areaAndPerimiter 24.0 30.0 18.0
(72.0,216.0)
> 

> :t distance 
distance :: Floating a => (a, a) -> (a, a) -> a
> 
{- Distance from (0, 0) to (3, 4) -}
> distance (0, 0) (3, 4)
5.0
> 
> distance (-3, -4) (3, 4)
10.0
> 


> ft 0
10
> ft 1
30
> map ft [0, 1, 2, 3]
[10,30,50,8]
> ft 10
 ** Exception: Invalid Value
> ft 9
 ** Exception: Invalid Value
> 

#+END_SRC

Sources:

 - [[http://www.mathopenref.com/heronsformula.html][Heron Formula]]
 
