haskell/Functions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Functions</title>
<!-- 2017-03-06 seg 12:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Caio Rodrigues" />
<link href='/theme/style.css' rel='stylesheet'>
<link href="/Functional-Programming/theme/style.css" rel="stylesheet">


</head>
<body>
<div id="content">
<h1 class="title">Functions</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Functions</a>
<ul>
<li><a href="#sec-1-1">1.1. Creating functions</a></li>
<li><a href="#sec-1-2">1.2. Anonymous Functions or Lambda Functions</a></li>
<li><a href="#sec-1-3">1.3. Infix Functions</a></li>
<li><a href="#sec-1-4">1.4. Infix Operators as Functions</a></li>
<li><a href="#sec-1-5">1.5. Currying</a></li>
<li><a href="#sec-1-6">1.6. The Dolar sign apply operator.</a></li>
<li><a href="#sec-1-7">1.7. Recursion</a></li>
<li><a href="#sec-1-8">1.8. Integer Arithmetic Functions</a></li>
<li><a href="#sec-1-9">1.9. Mathematical Functions</a></li>
<li><a href="#sec-1-10">1.10. Standard Functions</a></li>
<li><a href="#sec-1-11">1.11. Higher Order Functions</a>
<ul>
<li><a href="#sec-1-11-1">1.11.1. Overview</a></li>
<li><a href="#sec-1-11-2">1.11.2. Map</a></li>
<li><a href="#sec-1-11-3">1.11.3. Filter</a></li>
<li><a href="#sec-1-11-4">1.11.4. Higher-order predicates</a></li>
<li><a href="#sec-1-11-5">1.11.5. Fold</a></li>
<li><a href="#sec-1-11-6">1.11.6. Scanl</a></li>
<li><a href="#sec-1-11-7">1.11.7. Curry and Uncurrying</a></li>
<li><a href="#sec-1-11-8">1.11.8. Flip</a></li>
<li><a href="#sec-1-11-9">1.11.9. Iterate</a></li>
<li><a href="#sec-1-11-10">1.11.10. takeWhile</a></li>
<li><a href="#sec-1-11-11">1.11.11. dropWhile</a></li>
<li><a href="#sec-1-11-12">1.11.12. Zip and Unzip</a></li>
<li><a href="#sec-1-11-13">1.11.13. ZipWith</a></li>
<li><a href="#sec-1-11-14">1.11.14. Replicate</a></li>
<li><a href="#sec-1-11-15">1.11.15. Other Useful higher-order functions</a></li>
</ul>
</li>
<li><a href="#sec-1-12">1.12. Functions to Manipulate Characters and Strings</a>
<ul>
<li><a href="#sec-1-12-1">1.12.1. Strings Features</a></li>
<li><a href="#sec-1-12-2">1.12.2. Prelude String Functions</a></li>
<li><a href="#sec-1-12-3">1.12.3. Data.Char String Functions</a></li>
<li><a href="#sec-1-12-4">1.12.4. Data.List.Split String Functions</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<lu> 
  <li><a href="/Functional-Programming/index.html">Index</a></li>
  <li><a href="https://github.com/caiorss/Functional-Programming">Repository</a></li>
</lu>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Functions</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Creating functions</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In the GHCI Shell
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f x y <span class="org-haskell-operator">=</span> sqrt ( x<span class="org-haskell-operator">^</span>2 <span class="org-haskell-operator">+</span> y<span class="org-haskell-operator">^</span>2 )
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">f</span> 80 60
100.0
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">f</span> 50 30
58.309518948453004
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t f
<span class="org-haskell-definition">f</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Floating</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">putStrLn</span> <span class="org-string">"Hello World"</span>
<span class="org-haskell-constructor">Hello</span> <span class="org-haskell-constructor">World</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
In a Haskell source file, functions.hs
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">{- </span><span class="org-comment">Triangle Area as function of sides -}</span>
<span class="org-haskell-definition">triangleArea</span> a b c <span class="org-haskell-operator">=</span>  sqrt(p <span class="org-haskell-operator">*</span> (p <span class="org-haskell-operator">-</span> a) <span class="org-haskell-operator">*</span> ( p <span class="org-haskell-operator">-</span> b) <span class="org-haskell-operator">*</span> (p <span class="org-haskell-operator">-</span> c))
    <span class="org-haskell-keyword">where</span> 
    p <span class="org-haskell-operator">=</span> (a <span class="org-haskell-operator">+</span> b <span class="org-haskell-operator">+</span> c) <span class="org-haskell-operator">/</span> 2.0

<span class="org-haskell-definition">triangleArea2</span> a b c <span class="org-haskell-operator">=</span>  sqrt(p <span class="org-haskell-operator">*</span> pa <span class="org-haskell-operator">*</span> pb  <span class="org-haskell-operator">*</span>  pc)
    <span class="org-haskell-keyword">where</span> 
    pa <span class="org-haskell-operator">=</span> p <span class="org-haskell-operator">-</span> a
    pb <span class="org-haskell-operator">=</span> p <span class="org-haskell-operator">-</span> b
    pc <span class="org-haskell-operator">=</span> p <span class="org-haskell-operator">-</span> c
    p <span class="org-haskell-operator">=</span> (a <span class="org-haskell-operator">+</span> b <span class="org-haskell-operator">+</span> c) <span class="org-haskell-operator">/</span> 2.0


<span class="org-haskell-definition">triangleArea3</span> a b c <span class="org-haskell-operator">=</span>  <span class="org-haskell-keyword">let</span> pa <span class="org-haskell-operator">=</span> p <span class="org-haskell-operator">-</span> a
                           pb <span class="org-haskell-operator">=</span> p <span class="org-haskell-operator">-</span> b
                           pc <span class="org-haskell-operator">=</span> p <span class="org-haskell-operator">-</span> c
                           p <span class="org-haskell-operator">=</span> (a <span class="org-haskell-operator">+</span> b <span class="org-haskell-operator">+</span> c) <span class="org-haskell-operator">/</span> 2.0
                           <span class="org-haskell-keyword">in</span> sqrt(p <span class="org-haskell-operator">*</span> pa <span class="org-haskell-operator">*</span> pb  <span class="org-haskell-operator">*</span>  pc)

<span class="org-comment-delimiter">{- </span><span class="org-comment">Returning more than one value -}</span>    
<span class="org-haskell-definition">areaAndPerimiter</span> a b c <span class="org-haskell-operator">=</span>  (2.0 <span class="org-haskell-operator">*</span> p, sqrt(p <span class="org-haskell-operator">*</span> (p <span class="org-haskell-operator">-</span> a) <span class="org-haskell-operator">*</span> ( p <span class="org-haskell-operator">-</span> b) <span class="org-haskell-operator">*</span> (p <span class="org-haskell-operator">-</span> c)))
    <span class="org-haskell-keyword">where</span> 
    p <span class="org-haskell-operator">=</span> (a <span class="org-haskell-operator">+</span> b <span class="org-haskell-operator">+</span> c) <span class="org-haskell-operator">/</span> 2.0


<span class="org-haskell-definition">ft</span> 0 <span class="org-haskell-operator">=</span> 10
<span class="org-haskell-definition">ft</span> 1 <span class="org-haskell-operator">=</span> 30
<span class="org-haskell-definition">ft</span> 2 <span class="org-haskell-operator">=</span> 50
<span class="org-haskell-definition">ft</span> 3 <span class="org-haskell-operator">=</span> 8
<span class="org-haskell-definition">ft</span> <span class="org-haskell-keyword">_</span> <span class="org-haskell-operator">=</span> error <span class="org-string">"Invalid Value"</span>

<span class="org-comment-delimiter">{- </span><span class="org-comment">Distance between two points in a plane -}</span>
<span class="org-haskell-definition">distance</span> (x1, y1) (x2, y2) <span class="org-haskell-operator">=</span> sqrt ((x2 <span class="org-haskell-operator">-</span> x1)<span class="org-haskell-operator">^</span>2 <span class="org-haskell-operator">+</span> (y2 <span class="org-haskell-operator">-</span> y1)<span class="org-haskell-operator">^</span>2)
</pre>
</div>

<p>
Loading functions.hs
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>l functions<span class="org-haskell-operator">.</span>hs
[1 <span class="org-haskell-keyword">of</span> 1] <span class="org-haskell-constructor">Compiling</span> <span class="org-haskell-constructor">Main</span>             ( <span class="org-haskell-operator">/</span>tmp<span class="org-haskell-operator">/</span>functions<span class="org-haskell-operator">.</span>hs, interpreted )
<span class="org-haskell-constructor">Ok</span>, modules loaded<span class="org-haskell-constructor">:</span> Main.
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t triangleArea 
<span class="org-haskell-definition">triangleArea</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Floating</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">triangleArea</span> 24.0 30.0 18.0
216.0
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">triangleArea2</span> 24.0 30.0 18.0
216.0
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">triangleArea3</span> 24.0 30.0 18.0
216.0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">areaAndPerimiter</span> 24.0 30.0 18.0
(72.0,216.0)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t distance 
<span class="org-haskell-definition">distance</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Floating</span> a <span class="org-haskell-operator">=&gt;</span> (a, a) <span class="org-haskell-operator">-&gt;</span> (a, a) <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-comment-delimiter">{- </span><span class="org-comment">Distance from (0, 0) to (3, 4) -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">distance</span> (0, 0) (3, 4)
5.0
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">distance</span> (<span class="org-haskell-operator">-</span>3, <span class="org-haskell-operator">-</span>4) (3, 4)
10.0
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ft</span> 0
10
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ft</span> 1
30
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> ft [0, 1, 2, 3]
[10,30,50,8]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ft</span> 10
 <span class="org-haskell-operator">**</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">Invalid</span> <span class="org-haskell-constructor">Value</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">ft</span> 9
 <span class="org-haskell-operator">**</span> <span class="org-haskell-constructor">Exception:</span> <span class="org-haskell-constructor">Invalid</span> <span class="org-haskell-constructor">Value</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Sources:
</p>

<ul class="org-ul">
<li><a href="http://www.mathopenref.com/heronsformula.html">Heron Formula</a>
</li>
</ul>
</div>
</div>
