haskell/Functions.org
** Anonymous Functions or Lambda Functions



#+BEGIN_SRC haskell

> (\x -> x^2 - 2.5*x) 10
75.0

> let f = \x -> x^2 - 2.5*x

> map f [1, 2, 3, 4, 5]
[-1.5,-1.0,1.5,6.0,12.5]

> map (\x -> x^2 - 2.5*x) [1, 2, 3, 4, 5]
[-1.5,-1.0,1.5,6.0,12.5]

>  let f = (\x y -> x + y)
>  
>  f 20 30
50
>  let f20 = f 20
>  f20 10
30
>  (\x y -> x/y + x*y) 10 20
200.5
>  (\(x, y) -> x/y + x*y) (10, 20)
200.5
>  


#+END_SRC

** Infix Functions

Any function of two arguments can be used as an infix function or custom operator.

Example:

#+BEGIN_SRC haskell
> let addVectors (a1, a2, a3) (b1, b2, b3) = (a1+b1, a2+b2, a3+b3)
> let subVectors (a1, a2, a3) (b1, b2, b3) = (a1-b1, a2-b2, a3-b3)

> :t addVectors 
addVectors :: (Num t, Num t1, Num t2) =>  (t, t1, t2) -> (t, t1, t2) -> (t, t1, t2)

> :t subVectors 
subVectors   :: (Num t, Num t1, Num t2) => (t, t1, t2) -> (t, t1, t2) -> (t, t1, t2)


> addVectors (23, 10, 4) (3, 8, 9)
(26,18,13)


> (23, 10, 4) `addVectors` (3, 8, 9) -- Used as an infix function
(26,18,13)
> 

> subVectors (23, 10, 4) (3, 8, 9)
(20,2,-5)
> 

> (23, 10, 4) `subVectors` (3, 8, 9)
(20,2,-5)
> 

{- Using Custom Operators -}
> let (@+) (a1, a2, a3) (b1, b2, b3) = (a1+b1, a2+b2, a3+b3)
> let (@-) (a1, a2, a3) (b1, b2, b3) = (a1-b1, a2-b2, a3-b3)
> 
> 
> (23, 10, 4) @+ (3, 8, 9)
(26,18,13)
> (23, 10, 4) @-  (3, 8, 9)
(20,2,-5)
> 
>
> (@+) (23, 10, 4) (3, 8, 9)
(26,18,13)
> (@-) (23, 10, 4) (3, 8, 9)
(20,2,-5)
>

> let f x y = 10*x - y^2
> 
> f 10 3
91
> 10 `f` 3
91
> 

> let addJust (Just a) (Just b) = Just (a+b)
> addJust (Just 10) (Just 30)
Just 40
> 

> (Just 10) `addJust` (Just 30) -- Used as custom operator
Just 40
> 
#+END_SRC

