haskell/Functions.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Anonymous Functions or Lambda Functions</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x<span class="org-haskell-operator">^</span>2 <span class="org-haskell-operator">-</span> 2.5<span class="org-haskell-operator">*</span>x) 10
75.0

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f <span class="org-haskell-operator">=</span> <span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x<span class="org-haskell-operator">^</span>2 <span class="org-haskell-operator">-</span> 2.5<span class="org-haskell-operator">*</span>x

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> f [1, 2, 3, 4, 5]
[<span class="org-haskell-operator">-</span>1.5,<span class="org-haskell-operator">-</span>1.0,1.5,6.0,12.5]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x<span class="org-haskell-operator">^</span>2 <span class="org-haskell-operator">-</span> 2.5<span class="org-haskell-operator">*</span>x) [1, 2, 3, 4, 5]
[<span class="org-haskell-operator">-</span>1.5,<span class="org-haskell-operator">-</span>1.0,1.5,6.0,12.5]

<span class="org-haskell-operator">&gt;</span>  <span class="org-haskell-keyword">let</span> f <span class="org-haskell-operator">=</span> (<span class="org-haskell-operator">\</span>x y <span class="org-haskell-operator">-&gt;</span> x <span class="org-haskell-operator">+</span> y)
<span class="org-haskell-operator">&gt;</span>  
<span class="org-haskell-operator">&gt;</span>  f 20 30
50
<span class="org-haskell-operator">&gt;</span>  <span class="org-haskell-keyword">let</span> f20 <span class="org-haskell-operator">=</span> f 20
<span class="org-haskell-operator">&gt;</span>  f20 10
30
<span class="org-haskell-operator">&gt;</span>  (<span class="org-haskell-operator">\</span>x y <span class="org-haskell-operator">-&gt;</span> x<span class="org-haskell-operator">/</span>y <span class="org-haskell-operator">+</span> x<span class="org-haskell-operator">*</span>y) 10 20
200.5
<span class="org-haskell-operator">&gt;</span>  (<span class="org-haskell-operator">\</span>(x, y) <span class="org-haskell-operator">-&gt;</span> x<span class="org-haskell-operator">/</span>y <span class="org-haskell-operator">+</span> x<span class="org-haskell-operator">*</span>y) (10, 20)
200.5
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Infix Functions</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Any function of two arguments can be used as an infix function or custom operator.
</p>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> addVectors (a1, a2, a3) (b1, b2, b3) <span class="org-haskell-operator">=</span> (a1<span class="org-haskell-operator">+</span>b1, a2<span class="org-haskell-operator">+</span>b2, a3<span class="org-haskell-operator">+</span>b3)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> subVectors (a1, a2, a3) (b1, b2, b3) <span class="org-haskell-operator">=</span> (a1<span class="org-haskell-operator">-</span>b1, a2<span class="org-haskell-operator">-</span>b2, a3<span class="org-haskell-operator">-</span>b3)

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t addVectors 
<span class="org-haskell-definition">addVectors</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Num</span> t, <span class="org-haskell-type">Num</span> t1, <span class="org-haskell-type">Num</span> t2) <span class="org-haskell-operator">=&gt;</span>  (t, t1, t2) <span class="org-haskell-operator">-&gt;</span> (t, t1, t2) <span class="org-haskell-operator">-&gt;</span> (t, t1, t2)

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t subVectors 
<span class="org-haskell-definition">subVectors</span>   <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Num</span> t, <span class="org-haskell-type">Num</span> t1, <span class="org-haskell-type">Num</span> t2) <span class="org-haskell-operator">=&gt;</span> (t, t1, t2) <span class="org-haskell-operator">-&gt;</span> (t, t1, t2) <span class="org-haskell-operator">-&gt;</span> (t, t1, t2)


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">addVectors</span> (23, 10, 4) (3, 8, 9)
(26,18,13)


<span class="org-haskell-operator">&gt;</span> (23, 10, 4) <span class="org-haskell-operator">`addVectors`</span> (3, 8, 9) <span class="org-comment-delimiter">-- </span><span class="org-comment">Used as an infix function</span>
(26,18,13)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">subVectors</span> (23, 10, 4) (3, 8, 9)
(20,2,<span class="org-haskell-operator">-</span>5)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (23, 10, 4) <span class="org-haskell-operator">`subVectors`</span> (3, 8, 9)
(20,2,<span class="org-haskell-operator">-</span>5)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Using Custom Operators -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> (<span class="org-haskell-operator">@+</span>) (a1, a2, a3) (b1, b2, b3) <span class="org-haskell-operator">=</span> (a1<span class="org-haskell-operator">+</span>b1, a2<span class="org-haskell-operator">+</span>b2, a3<span class="org-haskell-operator">+</span>b3)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> (<span class="org-haskell-operator">@-</span>) (a1, a2, a3) (b1, b2, b3) <span class="org-haskell-operator">=</span> (a1<span class="org-haskell-operator">-</span>b1, a2<span class="org-haskell-operator">-</span>b2, a3<span class="org-haskell-operator">-</span>b3)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> (23, 10, 4) <span class="org-haskell-operator">@+</span> (3, 8, 9)
(26,18,13)
<span class="org-haskell-operator">&gt;</span> (23, 10, 4) <span class="org-haskell-operator">@-</span>  (3, 8, 9)
(20,2,<span class="org-haskell-operator">-</span>5)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">@+</span>) (23, 10, 4) (3, 8, 9)
(26,18,13)
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">@-</span>) (23, 10, 4) (3, 8, 9)
(20,2,<span class="org-haskell-operator">-</span>5)
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f x y <span class="org-haskell-operator">=</span> 10<span class="org-haskell-operator">*</span>x <span class="org-haskell-operator">-</span> y<span class="org-haskell-operator">^</span>2
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">f</span> 10 3
91
<span class="org-haskell-operator">&gt;</span> 10 <span class="org-haskell-operator">`f`</span> 3
91
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> addJust (<span class="org-haskell-constructor">Just</span> a) (<span class="org-haskell-constructor">Just</span> b) <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Just</span> (a<span class="org-haskell-operator">+</span>b)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">addJust</span> (<span class="org-haskell-constructor">Just</span> 10) (<span class="org-haskell-constructor">Just</span> 30)
<span class="org-haskell-constructor">Just</span> 40
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-constructor">Just</span> 10) <span class="org-haskell-operator">`addJust`</span> (<span class="org-haskell-constructor">Just</span> 30) <span class="org-comment-delimiter">-- </span><span class="org-comment">Used as custom operator</span>
<span class="org-haskell-constructor">Just</span> 40
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
