haskell/Functions.org
** Infix Operators as Functions



In Haskell the infix operators can be seen as a two-argument function.

#+BEGIN_SRC
x + y is equivalent to add x y or (+) x y
#+END_SRC


*Arithmetic Operators*

| Shorthand | Equivalence    | Type Signature                            |
|-----------+----------------+-------------------------------------------|
| (+4)      | \x -> x + 4    |                                           |
| (*3)      | \x -> x * 3    |                                           |
| (/2)      | \x -> x / 2    |                                           |
| (5-)      | \x -> 5 - x    |                                           |
| (-5)      | negate 5       | -5 :: Num a => a                          |
| (^2)      | \x -> x ^ 2    |                                           |
| (2^)      | \x -> 2 ^ x    |                                           |
| (+)       | \x y -> x + y  | (+) :: Num a => a -> a -> a               |
| (-)       | \x y -> x - y  | (-) :: Num a => a -> a -> a               |
| (/)       | \x y -> x / y  | (/) :: Fractional a => a -> a -> a        |
| (^)       | \x y -> x ^ y  | (^) :: (Integral b, Num a) => a -> b -> a |
| (*)       | \x y -> x ** y | (*) :: Floating a => a -> a -> a          |

*Comparison Operator*

| Shorthand | Equivalence      | Type Signature                  |
|-----------+------------------+---------------------------------|
| (>)       | =\x y -> x > y=  | (>) :: Ord a => a -> a -> Bool  |
| (<)       | =\x y -> x < y=  | (<) :: Ord a => a -> a -> Bool  |
| (>=)      | =\x y -> x >= y= | (>=) :: Ord a => a -> a -> Bool |
| (<=)      | \x y -> x <= y   | (<=) :: Ord a => a -> a -> Bool |
| (==)      | \x y -> x == y   | (==) :: Eq a => a -> a -> Bool  |
| (/=)      | \x y -> x /= y   | (/=) :: Eq a => a -> a -> Bool  |


*Boolean operators*

| Shorthand    | Equivalence            | Type Signature                     | Name |
|--------------+------------------------+------------------------------------+------|
| (&&)         | \x y -> x && y         | =(&&) :: Bool -> Bool -> Bool=     | And  |
| (\vert\vert) | \x y -> x \vert\vert y | \vert\vert :: Bool -> Bool -> Bool | Or   |
| not          | not x                  | =not :: Bool -> Bool=              | Not  |


*List and Tuples Operators*

| Shorthand | Equivalence           | Type Signature                   | Name                    |
|-----------+-----------------------+----------------------------------+-------------------------|
| (,)       | \x y -> (x, y)        | (,) :: a -> b -> (a, b)          | Tuple of two elements   |
| (,,)      | \x y z -> (x, y, z)   | (,,) :: a -> b -> c -> (a, b, c) | Tuple of three elements |
| (!!)      | alist !! i = alist[i] | (!!) :: [a] -> Int -> a          | Nth element of a list   |
| (:)       | \x xs -> x:xs         | (:) :: a -> [a] -> [a]           | Cons                    |

*Examples*

#+BEGIN_SRC haskell
> (+) 10 30.33
40.33

> map (10+) [1, 20, 43, 44]
[11,30,53,54]
> 

> (-) 100 30
70

> map ((-) 100) [10, 20, 80, -50]
[90,80,20,150]
> 
> map (+(-100)) [10, 20, 80, -50]
[-90,-80,-20,-150]


> (/) 100 10
10.0

> (*) 40 30
1200

> map (10*) [1, 2, 3, 4]
[10,20,30,40]
> 

> (^) 2 6
64

> 4 ** 0.5
2.0

> 2 ** 0.5
1.4142135623730951

> (**) 2  3.5
11.313708498984761
>

> map (0.5**) [1, 2, 3, 4]
[0.5,0.25,0.125,6.25e-2]

> map (**0.5) [1, 2, 3, 4]
[1.0,1.4142135623730951,1.7320508075688772,2.0]
> 

> (,) 4 5
(4,5)

> map ((,) 4) [1, 2, 3, 4]
[(4,1),(4,2),(4,3),(4,4)]

> map (flip (,) 4) [1, 2, 3, 4]
[(1,4),(2,4),(3,4),(4,4)]

> (,,) 4 5 7
(4,5,7)

> ((,,) 4) 5 6
(4,5,6)

> map (uncurry ((,,) 4)) [(5, 6), (1, 1), (3, 4)]
[(4,5,6),(4,1,1),(4,3,4)]

> map ((,,) 12 4) [1, 2, 3, 4]
[(12,4,1),(12,4,2),(12,4,3),(12,4,4)]
> 

> alist =  ['a', 'b', 'c', 'd', 'e'] 
> alist !! 0 
'a'
> alist !! 3
'd'
> 
> (!!3) alist
'd'
> (!!0) alist
'a'
> 
> (!!) alist 0
'a'
> (!!) alist 3
'd'

> map (alist!!) [0, 2, 3, 4]
"acde"
> 
> map (!!2) [['a', 'b', 'c'], ['y', 'w', 'x', 'z'], ['1', '2', '3', '4']]
"cx3"
> 


> (>) 30 10
True
> (<) 30 10
False
>
> map (>30) [60, 380, 23, 1, 100]
[True,True,False,False,True]
> 
> filter (>30) [60, 380, 23, 1, 100]
[60,380,100]
> 

> (==) 100 10
False
> (==) 10 10
True
> 
> 
> filter (10==) [100, 10, 20, 10, 30]
[10,10]
> 
> map (uncurry (==)) [(100, 100), (10, 23), (34, 44), (0, 0)]
[True,False,False,True]
> 
> filter (uncurry (==)) [(100, 100), (10, 23), (34, 44), (0, 0)]
[(100,100),(0,0)]
> 

> 10 /= 100
True
> 10 /= 10
False
> 
> 
> filter (/=10) [100, 10, 20, 10, 30]
[100,20,30]
> 
> filter (uncurry (/=)) [(100, 100), (10, 23), (34, 44), (0, 0)]
[(10,23),(34,44)]

> :t (+)
(+) :: Num a => a -> a -> a
> 
> :t (-)
(-) :: Num a => a -> a -> a
> 
> :t (/)
(/) :: Fractional a => a -> a -> a
> 
> :t (*)
(*) :: Num a => a -> a -> a
> 
> :t (^)
(^) :: (Integral b, Num a) => a -> b -> a

{- Cons Operator -}
> :t (:)
(:) :: a -> [a] -> [a]
> 

> (1:) [9, 2, 3, 4]
[1,9,2,3,4]
> 

> (:) 1 []
[1]

> (:) 1 [0, 3, 5, 6]
[1,0,3,5,6]
> 


> map (-1:) [[1, 2, 3], [5, 6], [0]]
[[-1,1,2,3],[-1,5,6],[-1,0]]
> 

> map (89:) [[1, 2, 3], [5, 6], [0]]
[[89,1,2,3],[89,5,6],[89,0]]
> 


> 1:[]
[1]
> 1:2:[]
[1,2]
> 1:2:3:[]
[1,2,3]
> 

> 1:[0]
[1,0]
> 2:1:[0]
[2,1,0]
> 

> (2:[1, 9, 8, 10])
[2,1,9,8,10]
> 

> (:[1, 2, 3, 4])  0
[0,1,2,3,4]
> 

> map (:[1, 2, 3, 4])  [89, 77, 55, 66]
[[89,1,2,3,4],[77,1,2,3,4],[55,1,2,3,4],[66,1,2,3,4]]
> 

> map (:["haskell "])  ["amazing", "awsome", "cool" ]
[["amazing","haskell "],["awsome","haskell "],["cool","haskell "]]
> 


#+END_SRC

