haskell/Functions.html

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Infix Operators as Functions</h3>
<div class="outline-text-3" id="text-1-4">
<p>
In Haskell the infix operators can be seen as a two-argument function.
</p>

<pre class="example">
x + y is equivalent to add x y or (+) x y
</pre>


<p>
<b>Arithmetic Operators</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Shorthand</th>
<th scope="col" class="left">Equivalence</th>
<th scope="col" class="left">Type Signature</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">(+4)</td>
<td class="left">\x -&gt; x + 4</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">(*3)</td>
<td class="left">\x -&gt; x * 3</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">(/2)</td>
<td class="left">\x -&gt; x / 2</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">(5-)</td>
<td class="left">\x -&gt; 5 - x</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">(-5)</td>
<td class="left">negate 5</td>
<td class="left">-5 :: Num a =&gt; a</td>
</tr>

<tr>
<td class="left">(^2)</td>
<td class="left">\x -&gt; x ^ 2</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">(2^)</td>
<td class="left">\x -&gt; 2 ^ x</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">(+)</td>
<td class="left">\x y -&gt; x + y</td>
<td class="left">(+) :: Num a =&gt; a -&gt; a -&gt; a</td>
</tr>

<tr>
<td class="left">(-)</td>
<td class="left">\x y -&gt; x - y</td>
<td class="left">(-) :: Num a =&gt; a -&gt; a -&gt; a</td>
</tr>

<tr>
<td class="left">(/)</td>
<td class="left">\x y -&gt; x / y</td>
<td class="left">(/) :: Fractional a =&gt; a -&gt; a -&gt; a</td>
</tr>

<tr>
<td class="left">(^)</td>
<td class="left">\x y -&gt; x ^ y</td>
<td class="left">(^) :: (Integral b, Num a) =&gt; a -&gt; b -&gt; a</td>
</tr>

<tr>
<td class="left">(*)</td>
<td class="left">\x y -&gt; x ** y</td>
<td class="left">(*) :: Floating a =&gt; a -&gt; a -&gt; a</td>
</tr>
</tbody>
</table>

<p>
<b>Comparison Operator</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Shorthand</th>
<th scope="col" class="left">Equivalence</th>
<th scope="col" class="left">Type Signature</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">(&gt;)</td>
<td class="left"><code>\x y -&gt; x &gt; y</code></td>
<td class="left">(&gt;) :: Ord a =&gt; a -&gt; a -&gt; Bool</td>
</tr>

<tr>
<td class="left">(&lt;)</td>
<td class="left"><code>\x y -&gt; x &lt; y</code></td>
<td class="left">(&lt;) :: Ord a =&gt; a -&gt; a -&gt; Bool</td>
</tr>

<tr>
<td class="left">(&gt;=)</td>
<td class="left"><code>\x y -&gt; x &gt;</code> y=</td>
<td class="left">(&gt;=) :: Ord a =&gt; a -&gt; a -&gt; Bool</td>
</tr>

<tr>
<td class="left">(&lt;=)</td>
<td class="left">\x y -&gt; x &lt;= y</td>
<td class="left">(&lt;=) :: Ord a =&gt; a -&gt; a -&gt; Bool</td>
</tr>

<tr>
<td class="left">(==)</td>
<td class="left">\x y -&gt; x == y</td>
<td class="left">(==) :: Eq a =&gt; a -&gt; a -&gt; Bool</td>
</tr>

<tr>
<td class="left">(/=)</td>
<td class="left">\x y -&gt; x /= y</td>
<td class="left">(/=) :: Eq a =&gt; a -&gt; a -&gt; Bool</td>
</tr>
</tbody>
</table>


<p>
<b>Boolean operators</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Shorthand</th>
<th scope="col" class="left">Equivalence</th>
<th scope="col" class="left">Type Signature</th>
<th scope="col" class="left">Name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">(&amp;&amp;)</td>
<td class="left">\x y -&gt; x &amp;&amp; y</td>
<td class="left"><code>(&amp;&amp;) :: Bool -&gt; Bool -&gt; Bool</code></td>
<td class="left">And</td>
</tr>

<tr>
<td class="left">(&vert;&vert;)</td>
<td class="left">\x y -&gt; x &vert;&vert; y</td>
<td class="left">&vert;&vert; :: Bool -&gt; Bool -&gt; Bool</td>
<td class="left">Or</td>
</tr>

<tr>
<td class="left">not</td>
<td class="left">not x</td>
<td class="left"><code>not :: Bool -&gt; Bool</code></td>
<td class="left">Not</td>
</tr>
</tbody>
</table>


<p>
<b>List and Tuples Operators</b>
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Shorthand</th>
<th scope="col" class="left">Equivalence</th>
<th scope="col" class="left">Type Signature</th>
<th scope="col" class="left">Name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">(,)</td>
<td class="left">\x y -&gt; (x, y)</td>
<td class="left">(,) :: a -&gt; b -&gt; (a, b)</td>
<td class="left">Tuple of two elements</td>
</tr>

<tr>
<td class="left">(,,)</td>
<td class="left">\x y z -&gt; (x, y, z)</td>
<td class="left">(,,) :: a -&gt; b -&gt; c -&gt; (a, b, c)</td>
<td class="left">Tuple of three elements</td>
</tr>

<tr>
<td class="left">(!!)</td>
<td class="left">alist !! i = alist[i]</td>
<td class="left">(!!) :: [a] -&gt; Int -&gt; a</td>
<td class="left">Nth element of a list</td>
</tr>

<tr>
<td class="left">(:)</td>
<td class="left">\x xs -&gt; x:xs</td>
<td class="left">(:) :: a -&gt; [a] -&gt; [a]</td>
<td class="left">Cons</td>
</tr>
</tbody>
</table>

<p>
<b>Examples</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">+</span>) 10 30.33
40.33

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (10<span class="org-haskell-operator">+</span>) [1, 20, 43, 44]
[11,30,53,54]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">-</span>) 100 30
70

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> ((<span class="org-haskell-operator">-</span>) 100) [10, 20, 80, <span class="org-haskell-operator">-</span>50]
[90,80,20,150]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">+</span>(<span class="org-haskell-operator">-</span>100)) [10, 20, 80, <span class="org-haskell-operator">-</span>50]
[<span class="org-haskell-operator">-</span>90,<span class="org-haskell-operator">-</span>80,<span class="org-haskell-operator">-</span>20,<span class="org-haskell-operator">-</span>150]


<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">/</span>) 100 10
10.0

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">*</span>) 40 30
1200

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (10<span class="org-haskell-operator">*</span>) [1, 2, 3, 4]
[10,20,30,40]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">^</span>) 2 6
64

<span class="org-haskell-operator">&gt;</span> 4 <span class="org-haskell-operator">**</span> 0.5
2.0

<span class="org-haskell-operator">&gt;</span> 2 <span class="org-haskell-operator">**</span> 0.5
1.4142135623730951

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">**</span>) 2  3.5
11.313708498984761
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (0.5<span class="org-haskell-operator">**</span>) [1, 2, 3, 4]
[0.5,0.25,0.125,6.25e-2]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">**</span>0.5) [1, 2, 3, 4]
[1.0,1.4142135623730951,1.7320508075688772,2.0]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">(,)</span> 4 5
(4,5)

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-constructor">(,)</span> 4) [1, 2, 3, 4]
[(4,1),(4,2),(4,3),(4,4)]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (flip <span class="org-haskell-constructor">(,)</span> 4) [1, 2, 3, 4]
[(1,4),(2,4),(3,4),(4,4)]

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">,,</span>) 4 5 7
(4,5,7)

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-constructor">(,,)</span> 4) 5 6
(4,5,6)

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (uncurry (<span class="org-haskell-constructor">(,,)</span> 4)) [(5, 6), (1, 1), (3, 4)]
[(4,5,6),(4,1,1),(4,3,4)]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-constructor">(,,)</span> 12 4) [1, 2, 3, 4]
[(12,4,1),(12,4,2),(12,4,3),(12,4,4)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">alist</span> <span class="org-haskell-operator">=</span>  [<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>, <span class="org-string">'d'</span>, <span class="org-string">'e'</span>] 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">alist</span> <span class="org-haskell-definition">!!</span> 0 
<span class="org-string">'a'</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">alist</span> <span class="org-haskell-definition">!!</span> 3
<span class="org-string">'d'</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">!!</span>3) alist
<span class="org-string">'d'</span>
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">!!</span>0) alist
<span class="org-string">'a'</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">!!</span>) alist 0
<span class="org-string">'a'</span>
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">!!</span>) alist 3
<span class="org-string">'d'</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (alist<span class="org-haskell-operator">!!</span>) [0, 2, 3, 4]
<span class="org-string">"acde"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">!!</span>2) [[<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>], [<span class="org-string">'y'</span>, <span class="org-string">'w'</span>, <span class="org-string">'x'</span>, <span class="org-string">'z'</span>], [<span class="org-string">'1'</span>, <span class="org-string">'2'</span>, <span class="org-string">'3'</span>, <span class="org-string">'4'</span>]]
<span class="org-string">"cx3"</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">&gt;</span>) 30 10
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">&lt;</span>) 30 10
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">&gt;</span>30) [60, 380, 23, 1, 100]
[<span class="org-haskell-constructor">True</span>,<span class="org-haskell-constructor">True</span>,<span class="org-haskell-constructor">False</span>,<span class="org-haskell-constructor">False</span>,<span class="org-haskell-constructor">True</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> (<span class="org-haskell-operator">&gt;</span>30) [60, 380, 23, 1, 100]
[60,380,100]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">==</span>) 100 10
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">==</span>) 10 10
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> (10<span class="org-haskell-operator">==</span>) [100, 10, 20, 10, 30]
[10,10]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (uncurry (<span class="org-haskell-operator">==</span>)) [(100, 100), (10, 23), (34, 44), (0, 0)]
[<span class="org-haskell-constructor">True</span>,<span class="org-haskell-constructor">False</span>,<span class="org-haskell-constructor">False</span>,<span class="org-haskell-constructor">True</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> (uncurry (<span class="org-haskell-operator">==</span>)) [(100, 100), (10, 23), (34, 44), (0, 0)]
[(100,100),(0,0)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 10 <span class="org-haskell-operator">/=</span> 100
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> 10 <span class="org-haskell-operator">/=</span> 10
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> (<span class="org-haskell-operator">/=</span>10) [100, 10, 20, 10, 30]
[100,20,30]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> (uncurry (<span class="org-haskell-operator">/=</span>)) [(100, 100), (10, 23), (34, 44), (0, 0)]
[(10,23),(34,44)]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t (<span class="org-haskell-operator">+</span>)
(<span class="org-haskell-definition">+</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t (<span class="org-haskell-operator">-</span>)
(<span class="org-haskell-definition">-</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t (<span class="org-haskell-operator">/</span>)
(<span class="org-haskell-definition">/</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Fractional</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t (<span class="org-haskell-operator">*</span>)
(<span class="org-haskell-definition">*</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t (<span class="org-haskell-operator">^</span>)
(<span class="org-haskell-definition">^</span>) <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Integral</span> b, <span class="org-haskell-type">Num</span> a) <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> a

<span class="org-comment-delimiter">{- </span><span class="org-comment">Cons Operator -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t (<span class="org-haskell-type">:</span>)
(<span class="org-haskell-definition">:</span>) <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> [a]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (1<span class="org-haskell-type">:</span>) [9, 2, 3, 4]
[1,9,2,3,4]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">:</span>) 1 <span class="org-haskell-constructor">[]</span>
[1]

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">:</span>) 1 [0, 3, 5, 6]
[1,0,3,5,6]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">-</span>1<span class="org-haskell-constructor">:</span>) [[1, 2, 3], [5, 6], [0]]
[[<span class="org-haskell-operator">-</span>1,1,2,3],[<span class="org-haskell-operator">-</span>1,5,6],[<span class="org-haskell-operator">-</span>1,0]]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (89<span class="org-haskell-constructor">:</span>) [[1, 2, 3], [5, 6], [0]]
[[89,1,2,3],[89,5,6],[89,0]]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> 1<span class="org-haskell-constructor">:[]</span>
[1]
<span class="org-haskell-operator">&gt;</span> 1<span class="org-haskell-constructor">:</span>2<span class="org-haskell-constructor">:[]</span>
[1,2]
<span class="org-haskell-operator">&gt;</span> 1<span class="org-haskell-constructor">:</span>2<span class="org-haskell-constructor">:</span>3<span class="org-haskell-constructor">:[]</span>
[1,2,3]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 1<span class="org-haskell-constructor">:</span>[0]
[1,0]
<span class="org-haskell-operator">&gt;</span> 2<span class="org-haskell-constructor">:</span>1<span class="org-haskell-constructor">:</span>[0]
[2,1,0]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (2<span class="org-haskell-constructor">:</span>[1, 9, 8, 10])
[2,1,9,8,10]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-constructor">:</span>[1, 2, 3, 4])  0
[0,1,2,3,4]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-constructor">:</span>[1, 2, 3, 4])  [89, 77, 55, 66]
[[89,1,2,3,4],[77,1,2,3,4],[55,1,2,3,4],[66,1,2,3,4]]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-constructor">:</span>[<span class="org-string">"haskell "</span>])  [<span class="org-string">"amazing"</span>, <span class="org-string">"awsome"</span>, <span class="org-string">"cool"</span> ]
[[<span class="org-string">"amazing"</span>,<span class="org-string">"haskell "</span>],[<span class="org-string">"awsome"</span>,<span class="org-string">"haskell "</span>],[<span class="org-string">"cool"</span>,<span class="org-string">"haskell "</span>]]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
