haskell/Functions.org
** Currying

Example 1:

#+BEGIN_SRC haskell

> let add a b = a + b
> let add10 = add 10
> 
> add 20 30
50
> add (-10) 30
20
> add10 20
30
> add10 30
40
> map add10 [-10, 20, 30, 40]
[0,30,40,50]
> 
#+END_SRC

** The Dolar sign apply operator.

#+BEGIN_SRC haskell
f $ x = f x

> :t ($)
($) :: (a -> b) -> a -> b
#+END_SRC

Example: This operator is useful to apply an argument to a list of functions.

#+BEGIN_SRC haskell
> ($ 10) (3*)
30
> 
> let f x = x*8 - 4
> 
> ($ 10) f
76
> 

> map ($ 3) [(*3), (+4), (^3)]
[9,7,27]
> 

#+END_SRC

OR

#+BEGIN_SRC haskell
> let apply x f = f x
> 
> map (apply 3)  [(*3), (+4), (^3)]
[9,7,27]
> 

#+END_SRC

See also the Clojure function [[https://clojuredocs.org/clojure.core/juxt][juxt]]

Apply a set of functions to a single argument.

#+BEGIN_SRC haskell
> let juxt fs x = map ($ x) fs

> juxt [(*3), (+4), (/10)] 30
[90.0,34.0,3.0]
> 
> let fs = juxt [(*3), (+4), (/10)]
> 
> :t fs
fs :: Double -> [Double]
>
> fs 30
[90.0,34.0,3.0]
> fs 40
[120.0,44.0,4.0]
> 
> map fs [10, 20, 30]
[[30.0,14.0,1.0],[60.0,24.0,2.0],[90.0,34.0,3.0]]
> 
> 
#+END_SRC

** Recursion

Reverse A list

#+BEGIN_SRC haskell

reverse2 :: [a] -> [a]
reverse2 []     = []
reverse2 (x:xs) = reverse2 xs ++ [x]

*Main> reverse2 [1, 2, 3, 4, 5]
[5,4,3,2,1]
#+END_SRC

Product of a List

#+BEGIN_SRC haskell

prod :: [Int] -> Int
prod [] = 1
prod (x:xs) = x * prod xs


*Main> prod [1, 2, 3, 4, 5]
120
*Main> 
*Main> :t prod
prod :: [Int] -> Int
#+END_SRC
Factorial

#+BEGIN_SRC haskell

fact 0 = 1
fact n = n*fact(n-1)

> map fact [1..10]
[1,2,6,24,120,720,5040,40320,362880,3628800]
#+END_SRC

Fibonacci Function

#+BEGIN_SRC haskell
fib 0 = 1
fib 1 = 1
fib n | n>= 2
    = fib(n-1) + fib(n-2)
#+END_SRC

