haskell/Functions.html

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Currying</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Example 1:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> add a b <span class="org-haskell-operator">=</span> a <span class="org-haskell-operator">+</span> b
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> add10 <span class="org-haskell-operator">=</span> add 10
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">add</span> 20 30
50
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">add</span> (<span class="org-haskell-operator">-</span>10) 30
20
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">add10</span> 20
30
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">add10</span> 30
40
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> add10 [<span class="org-haskell-operator">-</span>10, 20, 30, 40]
[0,30,40,50]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> The Dolar sign apply operator.</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-haskell">f <span class="org-haskell-definition">$</span> x <span class="org-haskell-operator">=</span> f x

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t (<span class="org-haskell-operator">$</span>)
(<span class="org-haskell-definition">$</span>) <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b) <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> b
</pre>
</div>

<p>
Example: This operator is useful to apply an argument to a list of functions.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">$</span> 10) (3<span class="org-haskell-operator">*</span>)
30
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f x <span class="org-haskell-operator">=</span> x<span class="org-haskell-operator">*</span>8 <span class="org-haskell-operator">-</span> 4
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">$</span> 10) f
76
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">$</span> 3) [(<span class="org-haskell-operator">*</span>3), (<span class="org-haskell-operator">+</span>4), (<span class="org-haskell-operator">^</span>3)]
[9,7,27]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
OR
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> apply x f <span class="org-haskell-operator">=</span> f x
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (apply 3)  [(<span class="org-haskell-operator">*</span>3), (<span class="org-haskell-operator">+</span>4), (<span class="org-haskell-operator">^</span>3)]
[9,7,27]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
See also the Clojure function <a href="https://clojuredocs.org/clojure.core/juxt">juxt</a>
</p>

<p>
Apply a set of functions to a single argument.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> juxt fs x <span class="org-haskell-operator">=</span> map (<span class="org-haskell-operator">$</span> x) fs

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">juxt</span> [(<span class="org-haskell-operator">*</span>3), (<span class="org-haskell-operator">+</span>4), (<span class="org-haskell-operator">/</span>10)] 30
[90.0,34.0,3.0]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> fs <span class="org-haskell-operator">=</span> juxt [(<span class="org-haskell-operator">*</span>3), (<span class="org-haskell-operator">+</span>4), (<span class="org-haskell-operator">/</span>10)]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t fs
<span class="org-haskell-definition">fs</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span> <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">Double</span>]
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fs</span> 30
[90.0,34.0,3.0]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">fs</span> 40
[120.0,44.0,4.0]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> fs [10, 20, 30]
[[30.0,14.0,1.0],[60.0,24.0,2.0],[90.0,34.0,3.0]]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Recursion</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Reverse A list
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">reverse2</span> <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> [a]
<span class="org-haskell-definition">reverse2</span> <span class="org-haskell-constructor">[]</span>     <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">[]</span>
<span class="org-haskell-definition">reverse2</span> (x<span class="org-haskell-constructor">:</span>xs) <span class="org-haskell-operator">=</span> reverse2 xs <span class="org-haskell-operator">++</span> [x]

<span class="org-haskell-operator">*</span><span class="org-haskell-constructor">Main</span><span class="org-haskell-operator">&gt;</span> reverse2 [1, 2, 3, 4, 5]
[5,4,3,2,1]
</pre>
</div>

<p>
Product of a List
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">prod</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Int</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
<span class="org-haskell-definition">prod</span> <span class="org-haskell-constructor">[]</span> <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">prod</span> (x<span class="org-haskell-constructor">:</span>xs) <span class="org-haskell-operator">=</span> x <span class="org-haskell-operator">*</span> prod xs


<span class="org-haskell-operator">*</span><span class="org-haskell-constructor">Main</span><span class="org-haskell-operator">&gt;</span> prod [1, 2, 3, 4, 5]
120
<span class="org-haskell-operator">*</span><span class="org-haskell-constructor">Main</span><span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">*</span><span class="org-haskell-constructor">Main</span><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t prod
<span class="org-haskell-definition">prod</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Int</span>] <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Int</span>
</pre>
</div>
<p>
Factorial
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">fact</span> 0 <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">fact</span> n <span class="org-haskell-operator">=</span> n<span class="org-haskell-operator">*</span>fact(n<span class="org-haskell-operator">-</span>1)

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> fact [1<span class="org-haskell-operator">..</span>10]
[1,2,6,24,120,720,5040,40320,362880,3628800]
</pre>
</div>

<p>
Fibonacci Function
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">fib</span> 0 <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">fib</span> 1 <span class="org-haskell-operator">=</span> 1
<span class="org-haskell-definition">fib</span> n <span class="org-haskell-operator">|</span> n<span class="org-haskell-operator">&gt;=</span> 2
    <span class="org-haskell-operator">=</span> fib(n<span class="org-haskell-operator">-</span>1) <span class="org-haskell-operator">+</span> fib(n<span class="org-haskell-operator">-</span>2)
</pre>
</div>
</div>
</div>
