haskell/Functions.org
** Integer Arithmetic Functions

| Function | Description                                                   |
|----------+---------------------------------------------------------------|
| even     | Test if number is even, multiple of 2                         |
| odd      | Test if number is odd, non multiple of 2                      |
| quot     | Quotient of two numbers                                       |
| rem      | Remainder from the quotient                                   |
| div      | Similar to "quot", but is rounded down towards minus infinity |
| mod      | Returns the modulus of the two numbers                        |
| divMod   | Returns the quotient and the modulus tuple                    |
| gcd      | Greatest common divisor of two numbers                        |
| lcd      | Lowest Common Multiple of two numbers                         |
| compare  | Compare two numbers                                           |

Exaples:

#+BEGIN_SRC haskell

{- -------------------Interger Division----------------- -}

{- Division Quotient -}

> quot 70 8
8
> 
> quot (-80)  8
-10
> 
> 80 `quot` 8
10
> 

> div 100 8
12
> 
> div (-100) 8
-13
> quot (-100) 8
-12
> 
> 100 `div` 8
12
> 

{- Remainder-}

> rem 100 12
4
> rem 100 10
0
> 100 `rem` 12
4
> 100 `rem` 10
0
> 
> rem (-100) 12
-4
> rem (-100) 10
0
> (-100) `rem` 12
-4
> (-100) `rem` 10
0
> 


> mod 100 12
4
> mod 100 10
0
> 100 `mod` 12
4
> 100 `mod` 10
0
> 
> mod (-100) 12
8
> 
> (-100) `mod` 12
8
> 


{- DivMod Quotient and Modulus of Division -}

> divMod 100 12
(8,4)
> divMod 100 10
(10,0)
> 100 `divMod` 12
(8,4)
> 100 `divMod` 10
(10,0)
> 
> divMod (-100) 12
(-9,8)
> divMod (-100) 10
(-10,0)
> 


{- Odd / Even Test -}

> even 20
True
> even 31
False

> odd 20
False
> odd 31
True

> [1..10]
[1,2,3,4,5,6,7,8,9,10]
> filter odd [1..10]
[1,3,5,7,9]
> filter even [1..10]
[2,4,6,8,10]
> 

{- Greatest Common Divisor -}

> gcd 840 15
15
> 
> gcd 21 14
7
> 
> 

> foldl1 gcd [21, 14, 35, 700]
7
> 


{- Lowest Common Multiple -}

> lcm 9 36
36
> 
> lcm 15 35
105
> 
{- 
    Lowest Common multiple of a list of numbers
    15 = 3 x 5
    35 = 5 x 7
    20 = 4 x 5
    40 = 8 x 5
    
    lcm = 3 x 5 x 8 = 840
-}
> foldl1 lcm [15, 35, 20, 40]
840
> 
#+END_SRC

Reference:

 - http://en.wikibooks.org/wiki/Haskell/A_Miscellany_of_Types

