haskell/Functions.html

<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> Integer Arithmetic Functions</h3>
<div class="outline-text-3" id="text-1-8">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Function</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">even</td>
<td class="left">Test if number is even, multiple of 2</td>
</tr>

<tr>
<td class="left">odd</td>
<td class="left">Test if number is odd, non multiple of 2</td>
</tr>

<tr>
<td class="left">quot</td>
<td class="left">Quotient of two numbers</td>
</tr>

<tr>
<td class="left">rem</td>
<td class="left">Remainder from the quotient</td>
</tr>

<tr>
<td class="left">div</td>
<td class="left">Similar to "quot", but is rounded down towards minus infinity</td>
</tr>

<tr>
<td class="left">mod</td>
<td class="left">Returns the modulus of the two numbers</td>
</tr>

<tr>
<td class="left">divMod</td>
<td class="left">Returns the quotient and the modulus tuple</td>
</tr>

<tr>
<td class="left">gcd</td>
<td class="left">Greatest common divisor of two numbers</td>
</tr>

<tr>
<td class="left">lcd</td>
<td class="left">Lowest Common Multiple of two numbers</td>
</tr>

<tr>
<td class="left">compare</td>
<td class="left">Compare two numbers</td>
</tr>
</tbody>
</table>

<p>
Exaples:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">{- </span><span class="org-comment">-------------------Interger Division----------------- -}</span>

<span class="org-comment-delimiter">{- </span><span class="org-comment">Division Quotient -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">quot</span> 70 8
8
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">quot</span> (<span class="org-haskell-operator">-</span>80)  8
<span class="org-haskell-operator">-</span>10
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 80 <span class="org-haskell-operator">`quot`</span> 8
10
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">div</span> 100 8
12
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">div</span> (<span class="org-haskell-operator">-</span>100) 8
<span class="org-haskell-operator">-</span>13
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">quot</span> (<span class="org-haskell-operator">-</span>100) 8
<span class="org-haskell-operator">-</span>12
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 100 <span class="org-haskell-operator">`div`</span> 8
12
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Remainder-}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">rem</span> 100 12
4
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">rem</span> 100 10
0
<span class="org-haskell-operator">&gt;</span> 100 <span class="org-haskell-operator">`rem`</span> 12
4
<span class="org-haskell-operator">&gt;</span> 100 <span class="org-haskell-operator">`rem`</span> 10
0
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">rem</span> (<span class="org-haskell-operator">-</span>100) 12
<span class="org-haskell-operator">-</span>4
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">rem</span> (<span class="org-haskell-operator">-</span>100) 10
0
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">-</span>100) <span class="org-haskell-operator">`rem`</span> 12
<span class="org-haskell-operator">-</span>4
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">-</span>100) <span class="org-haskell-operator">`rem`</span> 10
0
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mod</span> 100 12
4
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mod</span> 100 10
0
<span class="org-haskell-operator">&gt;</span> 100 <span class="org-haskell-operator">`mod`</span> 12
4
<span class="org-haskell-operator">&gt;</span> 100 <span class="org-haskell-operator">`mod`</span> 10
0
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mod</span> (<span class="org-haskell-operator">-</span>100) 12
8
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-operator">-</span>100) <span class="org-haskell-operator">`mod`</span> 12
8
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">DivMod Quotient and Modulus of Division -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">divMod</span> 100 12
(8,4)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">divMod</span> 100 10
(10,0)
<span class="org-haskell-operator">&gt;</span> 100 <span class="org-haskell-operator">`divMod`</span> 12
(8,4)
<span class="org-haskell-operator">&gt;</span> 100 <span class="org-haskell-operator">`divMod`</span> 10
(10,0)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">divMod</span> (<span class="org-haskell-operator">-</span>100) 12
(<span class="org-haskell-operator">-</span>9,8)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">divMod</span> (<span class="org-haskell-operator">-</span>100) 10
(<span class="org-haskell-operator">-</span>10,0)
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">Odd / Even Test -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">even</span> 20
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">even</span> 31
<span class="org-haskell-constructor">False</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">odd</span> 20
<span class="org-haskell-constructor">False</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">odd</span> 31
<span class="org-haskell-constructor">True</span>

<span class="org-haskell-operator">&gt;</span> [1<span class="org-haskell-operator">..</span>10]
[1,2,3,4,5,6,7,8,9,10]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> odd [1<span class="org-haskell-operator">..</span>10]
[1,3,5,7,9]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> even [1<span class="org-haskell-operator">..</span>10]
[2,4,6,8,10]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Greatest Common Divisor -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">gcd</span> 840 15
15
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">gcd</span> 21 14
7
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldl1</span> gcd [21, 14, 35, 700]
7
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">Lowest Common Multiple -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">lcm</span> 9 36
36
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">lcm</span> 15 35
105
<span class="org-haskell-operator">&gt;</span> 
<span class="org-comment-delimiter">{- </span>
<span class="org-comment">    Lowest Common multiple of a list of numbers</span>
<span class="org-comment">    15 = 3 x 5</span>
<span class="org-comment">    35 = 5 x 7</span>
<span class="org-comment">    20 = 4 x 5</span>
<span class="org-comment">    40 = 8 x 5</span>

<span class="org-comment">    lcm = 3 x 5 x 8 = 840</span>
<span class="org-comment">-}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldl1</span> lcm [15, 35, 20, 40]
840
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Reference:
</p>

<ul class="org-ul">
<li><a href="http://en.wikibooks.org/wiki/Haskell/A_Miscellany_of_Types">http://en.wikibooks.org/wiki/Haskell/A_Miscellany_of_Types</a>
</li>
</ul>
</div>
</div>
