haskell/Functions.org
** Mathematical Functions

Negate, Sqrt, Log, Exp and Power 

#+BEGIN_SRC haskell

{- Negate -}

> negate 100
-100
> negate 100.324
-100.324
> 


{- Natural logarithm -}
> log 10
2.302585092994046
> 

{- Logarithm to any base -}

> let log10 = logBase 10
> let log2  = logBase 2
> 
> log10 100
2.0
> map log10 [1, 10, 20, 100, 1000]
[0.0,1.0,1.3010299956639813,2.0,3.0]
> 
> map log2 [1, 2, 4, 8, 16]
[0.0,1.0,2.0,3.0,4.0]
> 

{- Square Root -}
> sqrt 100
10.0
> sqrt 10
3.1622776601683795
> 

{- Exponential function -}
> exp 1
2.718281828459045
> exp 2
7.38905609893065
> 

{- Pow/ Power Function x^y-}

> sqrt 2
1.4142135623730951
> 2 ** 0.5
1.4142135623730951
> 

> 2** 3
8.0
> 
> (**) 2 3
8.0
> 

> map round [13.03123, 13.20, 13.50, 13.60, 13.992]
[13,13,14,14,14]
> 
#+END_SRC

Trigonometric Functions

#+BEGIN_SRC haskell

> pi
3.141592653589793
>

> sin pi
1.2246063538223773e-16
> 
> sin (pi/3)
0.8660254037844386
> 
> asin (0.8660254037844386) == pi/3
True
> 


> cos pi
-1.0
>
> acos (-1)
3.141592653589793
> acos (-1) == pi
True
> 



> atan 1
0.7853981633974483
> 

> atan2 1 (-1)
2.356194490192345
> 
#+END_SRC


Floor, Round, Ceil 

#+BEGIN_SRC haskell

> map round [13.03123, 13.20, 13.50, 13.60, 13.992]
[13,13,14,14,14]
> 

> map truncate  [13.03123, 13.20, 13.50, 13.60, 13.992]
[13,13,13,13,13]
> 

> map floor [13.03123, 13.20, 13.50, 13.60, 13.992]
[13,13,13,13,13]
> 

> map ceiling [13.03123, 13.20, 13.50, 13.60, 13.992]
[14,14,14,14,14]
> 
#+END_SRC


Convert Integer to Floating Point

#+BEGIN_SRC haskell
> let inv x = 1/x

> :t inv
inv :: Fractional a => a -> a
> 


> let v = [1..10]
> v
[1,2,3,4,5,6,7,8,9,10]
> :t v
v :: [Integer]
> 

> inv 10
0.1
> inv 0.1
10.0
> 

> map inv v

<interactive>:20:5:
    No instance for (Fractional Integer) arising from a use of `inv'
    Possible fix: add an instance declaration for (Fractional Integer)
    In the first argument of `map', namely `inv'
    In the expression: map inv v
    In an equation for `it': it = map inv v

> map (inv . fromInteger) v
[1.0,0.5,0.3333333333333333,0.25,0.2,0.16666666666666666,0.14285714285714285,0.125,0.1111111111111111,0.1]
> 


#+END_SRC

** Standard Functions

*id Identity Function*

#+BEGIN_SRC haskell
> :t id
id :: a -> a

> 
> id 100
100
> id "Hello World"
"Hello World"
> 
#+END_SRC

*Constant Function*

#+BEGIN_SRC haskell
> :t const
const :: a -> b -> a
> 

> let f1 = const 10
> f1 20
10
> f1 0
10
> map f1 [1, 2, 3]
[10,10,10]

#+END_SRC

** Higher Order Functions
*** Overview 

Higher Order functions are functions that takes functions as arguments.

Why Higher Order Function?

 - Common programming idioms, such as applying a function twice, can naturally be encapsulated as general purpose higher-order functions (Hutton);

 - Special purpose languages can be defined within Haskell using higher-order functions, such as for list processing, interaction, or parsing (Hutton);

 - Algebraic properties of higher-order functions can be used to reason about programs. (Hutton)

Reference:

 - [[http://www.cs.nott.ac.uk/~gmh/functional.ppt][Graham Hutton Lecture]]
 - [[http://www.cs.nott.ac.uk/~gmh/][Graham Hutton - University of Nottingham]]

