haskell/Functions.html

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> Mathematical Functions</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Negate, Sqrt, Log, Exp and Power 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">{- </span><span class="org-comment">Negate -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">negate</span> 100
<span class="org-haskell-operator">-</span>100
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">negate</span> 100.324
<span class="org-haskell-operator">-</span>100.324
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">Natural logarithm -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">log</span> 10
2.302585092994046
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Logarithm to any base -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> log10 <span class="org-haskell-operator">=</span> logBase 10
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> log2  <span class="org-haskell-operator">=</span> logBase 2
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">log10</span> 100
2.0
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> log10 [1, 10, 20, 100, 1000]
[0.0,1.0,1.3010299956639813,2.0,3.0]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> log2 [1, 2, 4, 8, 16]
[0.0,1.0,2.0,3.0,4.0]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Square Root -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sqrt</span> 100
10.0
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sqrt</span> 10
3.1622776601683795
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Exponential function -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">exp</span> 1
2.718281828459045
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">exp</span> 2
7.38905609893065
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Pow/ Power Function x^y-}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sqrt</span> 2
1.4142135623730951
<span class="org-haskell-operator">&gt;</span> 2 <span class="org-haskell-operator">**</span> 0.5
1.4142135623730951
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 2<span class="org-haskell-operator">**</span> 3
8.0
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> (<span class="org-haskell-definition">**</span>) 2 3
8.0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> round [13.03123, 13.20, 13.50, 13.60, 13.992]
[13,13,14,14,14]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Trigonometric Functions
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> pi
3.141592653589793
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sin</span> pi
1.2246063538223773e-16
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sin</span> (pi<span class="org-haskell-operator">/</span>3)
0.8660254037844386
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">asin</span> (0.8660254037844386) <span class="org-haskell-operator">==</span> pi<span class="org-haskell-operator">/</span>3
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">cos</span> pi
<span class="org-haskell-operator">-</span>1.0
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">acos</span> (<span class="org-haskell-operator">-</span>1)
3.141592653589793
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">acos</span> (<span class="org-haskell-operator">-</span>1) <span class="org-haskell-operator">==</span> pi
<span class="org-haskell-constructor">True</span>
<span class="org-haskell-operator">&gt;</span> 



<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">atan</span> 1
0.7853981633974483
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">atan2</span> 1 (<span class="org-haskell-operator">-</span>1)
2.356194490192345
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
Floor, Round, Ceil 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> round [13.03123, 13.20, 13.50, 13.60, 13.992]
[13,13,14,14,14]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> truncate  [13.03123, 13.20, 13.50, 13.60, 13.992]
[13,13,13,13,13]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> floor [13.03123, 13.20, 13.50, 13.60, 13.992]
[13,13,13,13,13]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> ceiling [13.03123, 13.20, 13.50, 13.60, 13.992]
[14,14,14,14,14]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
Convert Integer to Floating Point
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> inv x <span class="org-haskell-operator">=</span> 1<span class="org-haskell-operator">/</span>x

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t inv
<span class="org-haskell-definition">inv</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Fractional</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> v <span class="org-haskell-operator">=</span> [1<span class="org-haskell-operator">..</span>10]
<span class="org-haskell-operator">&gt;</span> v
[1,2,3,4,5,6,7,8,9,10]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t v
<span class="org-haskell-definition">v</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Integer</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">inv</span> 10
0.1
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">inv</span> 0.1
10.0
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> inv v

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>20<span class="org-haskell-constructor">:</span>5<span class="org-haskell-constructor">:</span>
    <span class="org-haskell-constructor">No</span> <span class="org-haskell-keyword">instance</span> for (<span class="org-haskell-type">Fractional</span> <span class="org-haskell-type">Integer</span>) arising from a use <span class="org-haskell-keyword">of</span> `inv'
    <span class="org-haskell-constructor">Possible</span> fix<span class="org-haskell-constructor">:</span> add an <span class="org-haskell-keyword">instance</span> declaration for (<span class="org-haskell-type">Fractional</span> <span class="org-haskell-type">Integer</span>)
    <span class="org-haskell-constructor">In</span> the first argument <span class="org-haskell-keyword">of</span> `map', namely `inv'
    <span class="org-haskell-constructor">In</span> the expression<span class="org-haskell-constructor">:</span> map inv v
    <span class="org-haskell-constructor">In</span> an equation for `it'<span class="org-haskell-constructor">:</span> it <span class="org-haskell-operator">=</span> map inv v

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (inv <span class="org-haskell-operator">.</span> fromInteger) v
[1.0,0.5,0.3333333333333333,0.25,0.2,0.16666666666666666,0.14285714285714285,0.125,0.1111111111111111,0.1]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Standard Functions</h3>
<div class="outline-text-3" id="text-1-10">
<p>
<b>id Identity Function</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t id
<span class="org-haskell-definition">id</span> <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> a

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">id</span> 100
100
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">id</span> <span class="org-string">"Hello World"</span>
<span class="org-string">"Hello World"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>Constant Function</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t const
<span class="org-haskell-definition">const</span> <span class="org-haskell-operator">::</span> a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f1 <span class="org-haskell-operator">=</span> const 10
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">f1</span> 20
10
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">f1</span> 0
10
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> f1 [1, 2, 3]
[10,10,10]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> Higher Order Functions</h3>
<div class="outline-text-3" id="text-1-11">
</div><div id="outline-container-sec-1-11-1" class="outline-4">
<h4 id="sec-1-11-1"><span class="section-number-4">1.11.1</span> Overview</h4>
<div class="outline-text-4" id="text-1-11-1">
<p>
Higher Order functions are functions that takes functions as arguments.
</p>

<p>
Why Higher Order Function?
</p>

<ul class="org-ul">
<li>Common programming idioms, such as applying a function twice, can naturally be encapsulated as general purpose higher-order functions (Hutton);
</li>

<li>Special purpose languages can be defined within Haskell using higher-order functions, such as for list processing, interaction, or parsing (Hutton);
</li>

<li>Algebraic properties of higher-order functions can be used to reason about programs. (Hutton)
</li>
</ul>

<p>
Reference:
</p>

<ul class="org-ul">
<li><a href="http://www.cs.nott.ac.uk/~gmh/functional.ppt">Graham Hutton Lecture</a>
</li>
<li><a href="http://www.cs.nott.ac.uk/~gmh/">Graham Hutton - University of Nottingham</a>
</li>
</ul>
</div>
</div>
