haskell/Functions.html

<div id="outline-container-sec-1-11-2" class="outline-4">
<h4 id="sec-1-11-2"><span class="section-number-4">1.11.2</span> Map</h4>
<div class="outline-text-4" id="text-1-11-2">
<p>
See also: <a href="http://en.wikipedia.org/wiki/Map_(higher-order_function">Map (higher-order function)</a>)
</p>

<p>
map :: (a -&gt; b) -&gt; [a] -&gt; [b]
</p>

<p>
The map functional takes a function as its first argument, then applies it to every element of a list. 
<a href="http://www.willamette.edu/~fruehr/haskell/lectures/tutorial4.html#@sli@31">Programming in Haskell 3rd CCSC Northwest Conference  Fall 2001</a>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">^</span>2) [1<span class="org-haskell-operator">..</span>10]
[1,4,9,16,25,36,49,64,81,100]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">`div`</span> 3) [1<span class="org-haskell-operator">..</span>20]
[0,0,1,1,1,2,2,2,3,3,3,4,4,4,5,5,5,6,6,6]

<span class="org-comment-delimiter">{- </span><span class="org-comment">Map With Anonymous Functions -}</span>
<span class="org-haskell-operator">&gt;</span>  map (<span class="org-haskell-operator">\</span>x <span class="org-haskell-operator">-&gt;</span> x<span class="org-haskell-operator">*</span>x <span class="org-haskell-operator">-</span> 10<span class="org-haskell-operator">*</span>x) [1<span class="org-haskell-operator">..</span>10]
[<span class="org-haskell-operator">-</span>9,<span class="org-haskell-operator">-</span>16,<span class="org-haskell-operator">-</span>21,<span class="org-haskell-operator">-</span>24,<span class="org-haskell-operator">-</span>25,<span class="org-haskell-operator">-</span>24,<span class="org-haskell-operator">-</span>21,<span class="org-haskell-operator">-</span>16,<span class="org-haskell-operator">-</span>9,0]


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> reverse [<span class="org-string">"hey"</span>, <span class="org-string">"there"</span>, <span class="org-string">"world"</span>]
[<span class="org-string">"yeh"</span>,<span class="org-string">"ereht"</span>,<span class="org-string">"dlrow"</span>]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">reverse</span> [<span class="org-string">"hey"</span>, <span class="org-string">"there"</span>, <span class="org-string">"world"</span>]
[<span class="org-string">"world"</span>,<span class="org-string">"there"</span>,<span class="org-string">"hey"</span>]
</pre>
</div>

<p>
<b>Example Estimating PI</b>
</p>

<p>
Pi number can be approximated by Gregory series. 
</p>

<p>
<a href="http://shuklan.com/haskell/lec06.html#/0/6">http://shuklan.com/haskell/lec06.html#/0/6</a>
</p>


<pre class="example">
    n
  _____         k+1
  \         (-1)
4  \      ___________
   /        2k - 1
  /____
     1
</pre>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span>  <span class="org-haskell-keyword">let</span> f x <span class="org-haskell-operator">=</span> 4<span class="org-haskell-operator">*</span>(<span class="org-haskell-operator">-</span>1)<span class="org-haskell-operator">^</span>(x<span class="org-haskell-operator">+</span>1)<span class="org-haskell-operator">/</span>(2<span class="org-haskell-operator">*</span>k <span class="org-haskell-operator">-</span> 1) <span class="org-haskell-keyword">where</span> k <span class="org-haskell-operator">=</span> fromIntegral x
<span class="org-haskell-operator">&gt;</span>  <span class="org-haskell-keyword">let</span> piGuess n <span class="org-haskell-operator">=</span> sum <span class="org-haskell-operator">$</span> map f [1<span class="org-haskell-operator">..</span>n]
<span class="org-haskell-operator">&gt;</span>  
<span class="org-haskell-operator">&gt;</span>  map piGuess [1, 10, 20, 30, 50, 100]
[4.0,3.0418396189294032,3.09162380666784,3.108268566698947,3.121594652591011,3.1315929035585537]
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span>  <span class="org-comment-delimiter">{- </span><span class="org-comment">Approximation Error -}</span>
<span class="org-haskell-operator">&gt;</span>  
<span class="org-haskell-operator">&gt;</span>  map (pi <span class="org-haskell-operator">-</span>) <span class="org-haskell-operator">$</span> map piGuess [1, 10, 20, 30, 50, 100]
[<span class="org-haskell-operator">-</span>0.8584073464102069,9.975303466038987e-2,4.996884692195325e-2,3.332408689084598e-2,1.999800099878213e-2,9.99975003123943e-3]
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-3" class="outline-4">
<h4 id="sec-1-11-3"><span class="section-number-4">1.11.3</span> Filter</h4>
<div class="outline-text-4" id="text-1-11-3">
<p>
filter :: (a -&gt; Bool) -&gt; [a] -&gt; [a]
</p>

<p>
Returns elements of a list that satisfy a predicate.
Predicate is boolean function which returns True or False.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> even [1<span class="org-haskell-operator">..</span>10]
[2,4,6,8,10]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> (<span class="org-haskell-operator">&gt;</span>6) [1<span class="org-haskell-operator">..</span>20]
[7,8,9,10,11,12,13,14,15,16,17,18,19,20]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>Example With custom types</b>
</p>

<p>
Credits: <a href="http://shuklan.com/haskell/lec06.html#/0/10">http://shuklan.com/haskell/lec06.html#/0/10</a>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">data</span> <span class="org-haskell-type">Gender</span> <span class="org-haskell-operator">=</span> <span class="org-haskell-constructor">Male</span> <span class="org-haskell-operator">|</span> <span class="org-haskell-constructor">Female</span> <span class="org-haskell-keyword">deriving</span>(<span class="org-haskell-constructor">Show</span>, <span class="org-haskell-constructor">Eq</span>, <span class="org-haskell-constructor">Read</span>)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> people <span class="org-haskell-operator">=</span> [(<span class="org-haskell-constructor">Male</span>, <span class="org-string">"Tesla"</span>), (<span class="org-haskell-constructor">Male</span>, <span class="org-string">"Alber"</span>), (<span class="org-haskell-constructor">Female</span>, <span class="org-string">"Zoe"</span>), (<span class="org-haskell-constructor">Male</span>, <span class="org-string">"Tom"</span>), (<span class="org-haskell-constructor">Female</span>, <span class="org-string">"Olga"</span>), (<span class="org-haskell-constructor">Female</span>, <span class="org-string">"Mia"</span>), (<span class="org-haskell-constructor">Male</span>, <span class="org-string">"Abdulah"</span>)]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> (<span class="org-haskell-operator">\</span>(a, b) <span class="org-haskell-operator">-&gt;</span> a<span class="org-haskell-operator">==</span><span class="org-haskell-constructor">Female</span>) people
[(<span class="org-haskell-constructor">Female</span>,<span class="org-string">"Zoe"</span>),(<span class="org-haskell-constructor">Female</span>,<span class="org-string">"Olga"</span>),(<span class="org-haskell-constructor">Female</span>,<span class="org-string">"Mia"</span>)]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> (<span class="org-haskell-operator">\</span>(a, b) <span class="org-haskell-operator">-&gt;</span> a<span class="org-haskell-operator">==</span><span class="org-haskell-constructor">Male</span>) people
[(<span class="org-haskell-constructor">Male</span>,<span class="org-string">"Tesla"</span>),(<span class="org-haskell-constructor">Male</span>,<span class="org-string">"Alber"</span>),(<span class="org-haskell-constructor">Male</span>,<span class="org-string">"Tom"</span>),(<span class="org-haskell-constructor">Male</span>,<span class="org-string">"Abdulah"</span>)]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-4" class="outline-4">
<h4 id="sec-1-11-4"><span class="section-number-4">1.11.4</span> Higher-order predicates</h4>
<div class="outline-text-4" id="text-1-11-4">
<p>
Predicates (boolean-valued functions) can be extended to lists via the higher-order predicates any and all. 
<a href="http://www.willamette.edu/~fruehr/haskell/lectures/tutorial4.html#@sli@31">Programming in Haskell 3rd CCSC Northwest Conference  Fall 2001</a>]
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> even [1<span class="org-haskell-operator">..</span>5]
[<span class="org-haskell-constructor">False</span>,<span class="org-haskell-constructor">True</span>,<span class="org-haskell-constructor">False</span>,<span class="org-haskell-constructor">True</span>,<span class="org-haskell-constructor">False</span>]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">all</span> even (map (2<span class="org-haskell-operator">*</span>) [1<span class="org-haskell-operator">..</span>5])
<span class="org-haskell-constructor">True</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">any</span> odd [ x<span class="org-haskell-operator">^</span>2 <span class="org-haskell-operator">|</span> x<span class="org-haskell-operator">&lt;-</span>[1<span class="org-haskell-operator">..</span>5] ]
<span class="org-haskell-constructor">True</span>
</pre>
</div>
</div>
</div>
