haskell/Functions.org
*** Fold

The fold functions foldl and foldr combine elements of a list based on
a binary function and an initial value. In some programming languages
fold is known as reduce. The fold in some programming languages Python
is called reduce.

"The higher-order library function foldr (“fold right”) encapsulates
this simple pattern of recursion, with the function and the value v as
arguments" (Graham Hutton)

*Why Is Foldr Useful?* (Graham Hutton)

 - Some recursive functions on lists, such as sum, are simpler to
   define using foldr;

 - Properties of functions defined using foldr can be proved using
   algebraic properties of foldr, such as fusion and the banana split
   rule;

 - Advanced program optimisations can be simpler if foldr is used in
   place of explicit recursion.

*Right Fold*

#+BEGIN_SRC
foldr f z [x]

    f is a function of two arguments:
    z is is the initial value of the accumulator
    [x] Is a list of values

foldr (+)  10  [1, 2, 3, 4]  =>  ((+) 1 ((+) 2 ((+) 3 ((+) 4 10)))) => 20

 
         \ f            (f 1 (f 2 (f 3 (f 4 10)))) => ((+) 1 ((+) 2 ((+) 3 ((+) 4 10))))
        / \
       1   \
           /\ f         (f 2 (f 3 (f 4 10)))
          /  \
         2    \
              /\ f      (f 3 (f 4 10))
             /  \
            3    \
                 /\ f   (f 4 10)
                /  \
               /    \
               4     \
                      z = 10
        
#+END_SRC

Foldr Definition:

#+BEGIN_SRC
foldr :: (a -> b -> b) -> b -> [a] -> b
foldr f []     = v
foldr f (x:xs) = f x (foldr f xs)
#+END_SRC

*Left Fold*

#+BEGIN_SRC
foldl :: (a -> b -> a) -> a -> [b] -> a

foldl (+)  10  [1, 2, 3, 4]  =>  ((+) 4 ((+) 3 ((+) 2 ((+) 1 10)))) => 20

          \
          /\ f             (f 4 (f 3 (f 2 (f 1 10))))
         /  \
        /    \
       4      \ f          (f 3 (f 2 (f 1 10)))
             / \ 
            /   \
           3     \ f       (f 2 (f 1 10))
                 /\   
                /  \
               2    \ f    (f 1 10)
                   / \
                  /   \
                 1     \
                        z = 10
#+END_SRC


Common Haskell Functions can be defined using fold

#+BEGIN_SRC
sum     = foldr (+) 0
product = foldr (*) 1
and     = foldr (&&) True
#+END_SRC


Examples:

#+BEGIN_SRC haskell

-- Summation from 1 to 10
> foldr (+) 0 [1..10]
55

{- Product from 1 to 10 -}
> foldr (*) 1 [1..10]
3628800
> 

{- Maximum Number in a list -}

> foldr (\x y -> if x >= y then x else y ) 0 [ -10, 100, 1000, 20, 34.23, 10]
1000.0
> 

#+END_SRC


References:

 - [[http://www.cs.nott.ac.uk/~gmh/functional.ppt][Graham Hutton Lecture]]
 - [[http://www.cs.nott.ac.uk/~gmh/][Graham Hutton - University of Nottingham]]

*** Scanl

Shows the intermediate values of a fold.

#+BEGIN_SRC haskell

{- Cumulative Sum -}
> scanl (+) 0 [1..5]
[0,1,3,6,10,15]

{- Cumulative Product -}

> scanl (*) 1 [1..5]
[1,1,2,6,24,120]

#+END_SRC

