haskell/Functions.html

<div id="outline-container-sec-1-11-5" class="outline-4">
<h4 id="sec-1-11-5"><span class="section-number-4">1.11.5</span> Fold</h4>
<div class="outline-text-4" id="text-1-11-5">
<p>
The fold functions foldl and foldr combine elements of a list based on
a binary function and an initial value. In some programming languages
fold is known as reduce. The fold in some programming languages Python
is called reduce.
</p>

<p>
"The higher-order library function foldr (fold right) encapsulates
this simple pattern of recursion, with the function and the value v as
arguments" (Graham Hutton)
</p>

<p>
<b>Why Is Foldr Useful?</b> (Graham Hutton)
</p>

<ul class="org-ul">
<li>Some recursive functions on lists, such as sum, are simpler to
define using foldr;
</li>

<li>Properties of functions defined using foldr can be proved using
algebraic properties of foldr, such as fusion and the banana split
rule;
</li>

<li>Advanced program optimisations can be simpler if foldr is used in
place of explicit recursion.
</li>
</ul>

<p>
<b>Right Fold</b>
</p>

<pre class="example">
foldr f z [x]

    f is a function of two arguments:
    z is is the initial value of the accumulator
    [x] Is a list of values

foldr (+)  10  [1, 2, 3, 4]  =&gt;  ((+) 1 ((+) 2 ((+) 3 ((+) 4 10)))) =&gt; 20

 
         \ f            (f 1 (f 2 (f 3 (f 4 10)))) =&gt; ((+) 1 ((+) 2 ((+) 3 ((+) 4 10))))
        / \
       1   \
           /\ f         (f 2 (f 3 (f 4 10)))
          /  \
         2    \
              /\ f      (f 3 (f 4 10))
             /  \
            3    \
                 /\ f   (f 4 10)
                /  \
               /    \
               4     \
                      z = 10
</pre>

<p>
Foldr Definition:
</p>

<pre class="example">
foldr :: (a -&gt; b -&gt; b) -&gt; b -&gt; [a] -&gt; b
foldr f []     = v
foldr f (x:xs) = f x (foldr f xs)
</pre>

<p>
<b>Left Fold</b>
</p>

<pre class="example">
foldl :: (a -&gt; b -&gt; a) -&gt; a -&gt; [b] -&gt; a

foldl (+)  10  [1, 2, 3, 4]  =&gt;  ((+) 4 ((+) 3 ((+) 2 ((+) 1 10)))) =&gt; 20

          \
          /\ f             (f 4 (f 3 (f 2 (f 1 10))))
         /  \
        /    \
       4      \ f          (f 3 (f 2 (f 1 10)))
             / \ 
            /   \
           3     \ f       (f 2 (f 1 10))
                 /\   
                /  \
               2    \ f    (f 1 10)
                   / \
                  /   \
                 1     \
                        z = 10
</pre>


<p>
Common Haskell Functions can be defined using fold
</p>

<pre class="example">
sum     = foldr (+) 0
product = foldr (*) 1
and     = foldr (&amp;&amp;) True
</pre>


<p>
Examples:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">-- </span><span class="org-comment">Summation from 1 to 10</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldr</span> (<span class="org-haskell-operator">+</span>) 0 [1<span class="org-haskell-operator">..</span>10]
55

<span class="org-comment-delimiter">{- </span><span class="org-comment">Product from 1 to 10 -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldr</span> (<span class="org-haskell-operator">*</span>) 1 [1<span class="org-haskell-operator">..</span>10]
3628800
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Maximum Number in a list -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">foldr</span> (<span class="org-haskell-operator">\</span>x y <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-keyword">if</span> x <span class="org-haskell-operator">&gt;=</span> y <span class="org-haskell-keyword">then</span> x <span class="org-haskell-keyword">else</span> y ) 0 [ <span class="org-haskell-operator">-</span>10, 100, 1000, 20, 34.23, 10]
1000.0
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>


<p>
References:
</p>

<ul class="org-ul">
<li><a href="http://www.cs.nott.ac.uk/~gmh/functional.ppt">Graham Hutton Lecture</a>
</li>
<li><a href="http://www.cs.nott.ac.uk/~gmh/">Graham Hutton - University of Nottingham</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-11-6" class="outline-4">
<h4 id="sec-1-11-6"><span class="section-number-4">1.11.6</span> Scanl</h4>
<div class="outline-text-4" id="text-1-11-6">
<p>
Shows the intermediate values of a fold.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">{- </span><span class="org-comment">Cumulative Sum -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">scanl</span> (<span class="org-haskell-operator">+</span>) 0 [1<span class="org-haskell-operator">..</span>5]
[0,1,3,6,10,15]

<span class="org-comment-delimiter">{- </span><span class="org-comment">Cumulative Product -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">scanl</span> (<span class="org-haskell-operator">*</span>) 1 [1<span class="org-haskell-operator">..</span>5]
[1,1,2,6,24,120]
</pre>
</div>
</div>
</div>
