haskell/Functions.org
*** Curry and Uncurrying


*Curry*

Converts a function ((a, b) -> c) that has a single argument: a tuple of two values (a, b) to a new function that has a two arguments a and b and returns c. For short: curry converts an uncurried function to a curried function.

#+BEGIN_SRC
curry :: ((a, b) -> c) -> a -> b -> c 
#+END_SRC


*Uncurry*

Converts a function (a -> b -> c) that accepts a sequence of arguments a, b and returns c to a function that accepts a tuple of two arguments (a, b) and returns c. For short: it converts a curried function to a function on pairs.

This function and its variants are useful to map a function of multiple arguments over a list of arguments.

#+BEGIN_SRC
uncurry :: (a -> b -> c) -> (a, b) -> c
#+END_SRC

*Example: Uncurrying a function*

#+BEGIN_SRC haskell
> let f x y = 10*x - y
>
> :t f
f :: Num a => a -> a -> a
> 
> 
> f 2 4
#+END_SRC

The problem is: how to map f over a list of tuples ??

#+BEGIN_SRC haskell
> map f [(1, 2), (4, 5), (9, 10)]

<interactive>:122:5:
    No instance for (Num (t0, t1)) arising from a use of `f'
    Possible fix: add an instance declaration for (Num (t0, t1))
    In the first argument of `map', namely `f'
#+END_SRC

Solution: Uncurry the function f: 

#+BEGIN_SRC haskell

> let f' = uncurry f
>
> :t f'
f' :: (Integer, Integer) -> Integer
>
> 
> map f' [(1, 2), (4, 5), (9, 10)]
[8,35,80]
> 
> map (uncurry f) [(1, 2), (4, 5), (9, 10)]
[8,35,80]
> 
#+END_SRC

*Example: Currying a function*

#+BEGIN_SRC haskell
> let g (x, y) = 10*x - y
> 
> :t g
g :: Num a => (a, a) -> a
> 
> g (2, 4)
16
> 
> g 2 4
<interactive>:138:1:
    No instance for (Num (a0 -> t0)) arising from a use of `g'
    Possible fix: add an instance declaration for (Num (a0 -> t0))
    In the expression: g 2 4
    In an equation for `it': it = g 2 4
    ...
> 
> let g' = curry g
> :t g'
g' :: Integer -> Integer -> Integer
> 
> g' 2 4
16
> 
> (curry g) 2 4
16
> 
#+END_SRC

*Other Examples*

Map a function of 3 arguments and a function of 4 arguments of over a list of tuples:

#+BEGIN_SRC haskell

> let uncurry3 f (a, b, c) = f a b c
> let uncurry4 f (a, b, c, d) = f a b c d
> 
> :t uncurry3
uncurry3 :: (t1 -> t2 -> t3 -> t) -> (t1, t2, t3) -> t
> 
> :t uncurry4
uncurry4 :: (t1 -> t2 -> t3 -> t4 -> t) -> (t1, t2, t3, t4) -> t
> 
> 
> let f a b c = 10*a -2*(a+c) + 5*c
> 
> 
> map (uncurry3 f) [(2, 3, 5), (4, 9, 2), (3, 7, 9)]
[31,38,51]
> 
> 

> 
> let f x y z w = 2*x + 4*y + 10*z + w
> 
> map (uncurry4 f) [(2, 3, 5, 3), (4, 9, 2, 8), (3, 7, 9, 1)]
[69,72,125]
> 
#+END_SRC

*** Flip 

Converts a function of two arguments a, b to a new one with argument in inverse order of the old one.

#+BEGIN_SRC
flip :: (a -> b -> c) -> b -> a -> c
#+END_SRC

Example: 

#+BEGIN_SRC
> let f a b = 10*a + b
> 
> :t f
f :: Num a => a -> a -> a

> 
> f 5 6
56
>
> f 6 5
65
> 
> 
> (flip f) 5 6
65
> 
#+END_SRC

