haskell/Functions.html

<div id="outline-container-sec-1-11-7" class="outline-4">
<h4 id="sec-1-11-7"><span class="section-number-4">1.11.7</span> Curry and Uncurrying</h4>
<div class="outline-text-4" id="text-1-11-7">
<p>
<b>Curry</b>
</p>

<p>
Converts a function ((a, b) -&gt; c) that has a single argument: a tuple of two values (a, b) to a new function that has a two arguments a and b and returns c. For short: curry converts an uncurried function to a curried function.
</p>

<pre class="example">
curry :: ((a, b) -&gt; c) -&gt; a -&gt; b -&gt; c
</pre>


<p>
<b>Uncurry</b>
</p>

<p>
Converts a function (a -&gt; b -&gt; c) that accepts a sequence of arguments a, b and returns c to a function that accepts a tuple of two arguments (a, b) and returns c. For short: it converts a curried function to a function on pairs.
</p>

<p>
This function and its variants are useful to map a function of multiple arguments over a list of arguments.
</p>

<pre class="example">
uncurry :: (a -&gt; b -&gt; c) -&gt; (a, b) -&gt; c
</pre>

<p>
<b>Example: Uncurrying a function</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f x y <span class="org-haskell-operator">=</span> 10<span class="org-haskell-operator">*</span>x <span class="org-haskell-operator">-</span> y
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t f
<span class="org-haskell-definition">f</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">f</span> 2 4
</pre>
</div>

<p>
The problem is: how to map f over a list of tuples ??
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> f [(1, 2), (4, 5), (9, 10)]

<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>122<span class="org-haskell-constructor">:</span>5<span class="org-haskell-constructor">:</span>
    <span class="org-haskell-constructor">No</span> <span class="org-haskell-keyword">instance</span> for (<span class="org-haskell-type">Num</span> (t0, t1)) arising from a use <span class="org-haskell-keyword">of</span> `f'
    <span class="org-haskell-constructor">Possible</span> fix<span class="org-haskell-constructor">:</span> add an <span class="org-haskell-keyword">instance</span> declaration for (<span class="org-haskell-type">Num</span> (t0, t1))
    <span class="org-haskell-constructor">In</span> the first argument <span class="org-haskell-keyword">of</span> `map', namely `f'
</pre>
</div>

<p>
Solution: Uncurry the function f: 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f' <span class="org-haskell-operator">=</span> uncurry f
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t f'
<span class="org-haskell-definition">f'</span> <span class="org-haskell-operator">::</span> (<span class="org-haskell-type">Integer</span>, <span class="org-haskell-type">Integer</span>) <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> f' [(1, 2), (4, 5), (9, 10)]
[8,35,80]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (uncurry f) [(1, 2), (4, 5), (9, 10)]
[8,35,80]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>Example: Currying a function</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> g (x, y) <span class="org-haskell-operator">=</span> 10<span class="org-haskell-operator">*</span>x <span class="org-haskell-operator">-</span> y
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t g
<span class="org-haskell-definition">g</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> (a, a) <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">g</span> (2, 4)
16
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">g</span> 2 4
<span class="org-haskell-operator">&lt;</span>interactive<span class="org-haskell-operator">&gt;:</span>138<span class="org-haskell-constructor">:</span>1<span class="org-haskell-constructor">:</span>
    <span class="org-haskell-constructor">No</span> <span class="org-haskell-keyword">instance</span> for (<span class="org-haskell-type">Num</span> (a0 <span class="org-haskell-operator">-&gt;</span> t0)) arising from a use <span class="org-haskell-keyword">of</span> `g'
    <span class="org-haskell-constructor">Possible</span> fix<span class="org-haskell-constructor">:</span> add an <span class="org-haskell-keyword">instance</span> declaration for (<span class="org-haskell-type">Num</span> (a0 <span class="org-haskell-operator">-&gt;</span> t0))
    <span class="org-haskell-constructor">In</span> the expression<span class="org-haskell-constructor">:</span> g 2 4
    <span class="org-haskell-constructor">In</span> an equation for `it'<span class="org-haskell-constructor">:</span> it <span class="org-haskell-operator">=</span> g 2 4
    <span class="org-haskell-operator">...</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> g' <span class="org-haskell-operator">=</span> curry g
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t g'
<span class="org-haskell-definition">g'</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Integer</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Integer</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Integer</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">g'</span> 2 4
16
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> (curry g) 2 4
16
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>Other Examples</b>
</p>

<p>
Map a function of 3 arguments and a function of 4 arguments of over a list of tuples:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> uncurry3 f (a, b, c) <span class="org-haskell-operator">=</span> f a b c
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> uncurry4 f (a, b, c, d) <span class="org-haskell-operator">=</span> f a b c d
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t uncurry3
<span class="org-haskell-definition">uncurry3</span> <span class="org-haskell-operator">::</span> (t1 <span class="org-haskell-operator">-&gt;</span> t2 <span class="org-haskell-operator">-&gt;</span> t3 <span class="org-haskell-operator">-&gt;</span> t) <span class="org-haskell-operator">-&gt;</span> (t1, t2, t3) <span class="org-haskell-operator">-&gt;</span> t
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t uncurry4
<span class="org-haskell-definition">uncurry4</span> <span class="org-haskell-operator">::</span> (t1 <span class="org-haskell-operator">-&gt;</span> t2 <span class="org-haskell-operator">-&gt;</span> t3 <span class="org-haskell-operator">-&gt;</span> t4 <span class="org-haskell-operator">-&gt;</span> t) <span class="org-haskell-operator">-&gt;</span> (t1, t2, t3, t4) <span class="org-haskell-operator">-&gt;</span> t
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f a b c <span class="org-haskell-operator">=</span> 10<span class="org-haskell-operator">*</span>a <span class="org-haskell-operator">-</span>2<span class="org-haskell-operator">*</span>(a<span class="org-haskell-operator">+</span>c) <span class="org-haskell-operator">+</span> 5<span class="org-haskell-operator">*</span>c
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (uncurry3 f) [(2, 3, 5), (4, 9, 2), (3, 7, 9)]
[31,38,51]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f x y z w <span class="org-haskell-operator">=</span> 2<span class="org-haskell-operator">*</span>x <span class="org-haskell-operator">+</span> 4<span class="org-haskell-operator">*</span>y <span class="org-haskell-operator">+</span> 10<span class="org-haskell-operator">*</span>z <span class="org-haskell-operator">+</span> w
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (uncurry4 f) [(2, 3, 5, 3), (4, 9, 2, 8), (3, 7, 9, 1)]
[69,72,125]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-8" class="outline-4">
<h4 id="sec-1-11-8"><span class="section-number-4">1.11.8</span> Flip</h4>
<div class="outline-text-4" id="text-1-11-8">
<p>
Converts a function of two arguments a, b to a new one with argument in inverse order of the old one.
</p>

<pre class="example">
flip :: (a -&gt; b -&gt; c) -&gt; b -&gt; a -&gt; c
</pre>

<p>
Example: 
</p>

<pre class="example">
&gt; let f a b = 10*a + b
&gt; 
&gt; :t f
f :: Num a =&gt; a -&gt; a -&gt; a

&gt; 
&gt; f 5 6
56
&gt;
&gt; f 6 5
65
&gt; 
&gt; 
&gt; (flip f) 5 6
65
&gt;
</pre>
</div>
</div>
