haskell/Functions.org
*** Iterate

This function is useful for recursive algorithms like, root finding, numerical serie approximation, differential equation solving and finite differences.


#+BEGIN_SRC
iterate f x = x : iterate f (f x)
#+END_SRC

It creates an infinite list of iterates.

#+BEGIN_SRC haskell
[x, f x, f (f x), f (f (f x)), ...]
#+END_SRC

Example: [[http://www2.mae.ufl.edu/haftka/numerical/Lectures/Chapter6.1-2.pdf][source]]

Find the square root of a number by Fixed-point iteration

#+BEGIN_SRC
Xi+1 = g(Xi)
#+END_SRC

The magnitude of the derivative of g must be smaller than 1 for the method to work.

#+BEGIN_SRC
sqrt(a) --> f(x) = x^2 - a = 0 
x  = 1/2*(a/x+x)
x  = g(x) --> g(x) = 1/2*(a/x+x)
#+END_SRC


#+BEGIN_SRC haskell
> let f a x = 0.5*(a/x + x)

> let g = f 2 -- a = 2

> g 2
1.5
> g 1.5
1.4166666666666665
> g 1.41666
1.4142156747561165
> g 1.14142156
1.4468112805021982

{- OR -}

> let gen = iterate g 2
>
> take 5 gen
[2.0,1.5,1.4166666666666665,1.4142156862745097,1.4142135623746899]

{-- 
Finally the root algorithm  using the power of lazy evaluation
with the iterate function

--}

> let f a x = 0.5*(a/x + x)
> let root a =  last $ take 10 $ iterate (f a) a 
> 
> root 2
1.414213562373095
> root 2 - sqrt 2
-2.220446049250313e-16
> 
> root 10
3.162277660168379
> sqrt 10
3.1622776601683795
>
> root 10 - sqrt 10
-4.440892098500626e-16
> 
> 

#+END_SRC

*** takeWhile

Apply a predicate p to a list xs and returns the longest prefix, that can be empty of xs of elements that satisfy the predicate.

#+BEGIN_SRC haskell
> :t takeWhile
takeWhile :: (a -> Bool) -> [a] -> [a]
> 

{- Constant Function that always returns True-}
> :t const True
const True :: b -> Bool
> 
> takeWhile (const True)  [10, 20, 8, 4, 5, 7, 9] 
[10,20,8,4,5,7,9]
> 

> takeWhile (const False)  [10, 20, 8, 4, 5, 7, 9] 
[]
> 

> takeWhile (>5) [10, 20, 8, 4, 5, 7, 9] 
[10,20,8]
> 

> takeWhile (<10) [1, 2, 3, 9, 10, 20, 30]
[1,2,3,9]
> 

> takeWhile (/='a') "testing a function"
"testing "
> 


#+END_SRC

*** dropWhile

The function dropWhile apply a predicate p to a list xs and returns the suffix remaining after takeWhile.

Example:

#+BEGIN_SRC haskell
> :t dropWhile
dropWhile :: (a -> Bool) -> [a] -> [a]
> 

> dropWhile (const True) [10, 20, 8, 4, 5, 7, 9] 
[]

> dropWhile (const False) [10, 20, 8, 4, 5, 7, 9] 
[10,20,8,4,5,7,9]

> dropWhile (>5) [10, 20, 8, 4, 5, 7, 9]
[4,5,7,9]

> dropWhile (/='a') "testing a function"
"a function"
> 

#+END_SRC

