haskell/Functions.html

<div id="outline-container-sec-1-11-9" class="outline-4">
<h4 id="sec-1-11-9"><span class="section-number-4">1.11.9</span> Iterate</h4>
<div class="outline-text-4" id="text-1-11-9">
<p>
This function is useful for recursive algorithms like, root finding, numerical serie approximation, differential equation solving and finite differences.
</p>


<pre class="example">
iterate f x = x : iterate f (f x)
</pre>

<p>
It creates an infinite list of iterates.
</p>

<div class="org-src-container">

<pre class="src src-haskell">[x, f x, f (f x), f (f (f x)), <span class="org-haskell-operator">...</span>]
</pre>
</div>

<p>
Example: <a href="http://www2.mae.ufl.edu/haftka/numerical/Lectures/Chapter6.1-2.pdf">source</a>
</p>

<p>
Find the square root of a number by Fixed-point iteration
</p>

<pre class="example">
Xi+1 = g(Xi)
</pre>

<p>
The magnitude of the derivative of g must be smaller than 1 for the method to work.
</p>

<pre class="example">
sqrt(a) --&gt; f(x) = x^2 - a = 0 
x  = 1/2*(a/x+x)
x  = g(x) --&gt; g(x) = 1/2*(a/x+x)
</pre>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f a x <span class="org-haskell-operator">=</span> 0.5<span class="org-haskell-operator">*</span>(a<span class="org-haskell-operator">/</span>x <span class="org-haskell-operator">+</span> x)

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> g <span class="org-haskell-operator">=</span> f 2 <span class="org-comment-delimiter">-- </span><span class="org-comment">a = 2</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">g</span> 2
1.5
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">g</span> 1.5
1.4166666666666665
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">g</span> 1.41666
1.4142156747561165
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">g</span> 1.14142156
1.4468112805021982

<span class="org-comment-delimiter">{- </span><span class="org-comment">OR -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> gen <span class="org-haskell-operator">=</span> iterate g 2
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">take</span> 5 gen
[2.0,1.5,1.4166666666666665,1.4142156862745097,1.4142135623746899]

<span class="org-comment-delimiter">{-</span><span class="org-comment">- </span>
<span class="org-comment">Finally the root algorithm  using the power of lazy evaluation</span>
<span class="org-comment">with the iterate function</span>

<span class="org-comment">--}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f a x <span class="org-haskell-operator">=</span> 0.5<span class="org-haskell-operator">*</span>(a<span class="org-haskell-operator">/</span>x <span class="org-haskell-operator">+</span> x)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> root a <span class="org-haskell-operator">=</span>  last <span class="org-haskell-operator">$</span> take 10 <span class="org-haskell-operator">$</span> iterate (f a) a 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">root</span> 2
1.414213562373095
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">root</span> 2 <span class="org-haskell-operator">-</span> sqrt 2
<span class="org-haskell-operator">-</span>2.220446049250313e-16
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">root</span> 10
3.162277660168379
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">sqrt</span> 10
3.1622776601683795
<span class="org-haskell-operator">&gt;</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">root</span> 10 <span class="org-haskell-operator">-</span> sqrt 10
<span class="org-haskell-operator">-</span>4.440892098500626e-16
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-10" class="outline-4">
<h4 id="sec-1-11-10"><span class="section-number-4">1.11.10</span> takeWhile</h4>
<div class="outline-text-4" id="text-1-11-10">
<p>
Apply a predicate p to a list xs and returns the longest prefix, that can be empty of xs of elements that satisfy the predicate.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t takeWhile
<span class="org-haskell-definition">takeWhile</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> [a]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Constant Function that always returns True-}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t const <span class="org-haskell-type">True</span>
<span class="org-haskell-definition">const</span> <span class="org-haskell-constructor">True</span> <span class="org-haskell-operator">::</span> b <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takeWhile</span> (const <span class="org-haskell-type">True</span>)  [10, 20, 8, 4, 5, 7, 9] 
[10,20,8,4,5,7,9]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takeWhile</span> (const <span class="org-haskell-constructor">False</span>)  [10, 20, 8, 4, 5, 7, 9] 
<span class="org-haskell-constructor">[]</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takeWhile</span> (<span class="org-haskell-operator">&gt;</span>5) [10, 20, 8, 4, 5, 7, 9] 
[10,20,8]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takeWhile</span> (<span class="org-haskell-operator">&lt;</span>10) [1, 2, 3, 9, 10, 20, 30]
[1,2,3,9]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takeWhile</span> (<span class="org-haskell-operator">/=</span><span class="org-string">'a'</span>) <span class="org-string">"testing a function"</span>
<span class="org-string">"testing "</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-11" class="outline-4">
<h4 id="sec-1-11-11"><span class="section-number-4">1.11.11</span> dropWhile</h4>
<div class="outline-text-4" id="text-1-11-11">
<p>
The function dropWhile apply a predicate p to a list xs and returns the suffix remaining after takeWhile.
</p>

<p>
Example:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t dropWhile
<span class="org-haskell-definition">dropWhile</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> [a]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">dropWhile</span> (const <span class="org-haskell-type">True</span>) [10, 20, 8, 4, 5, 7, 9] 
<span class="org-haskell-constructor">[]</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">dropWhile</span> (const <span class="org-haskell-constructor">False</span>) [10, 20, 8, 4, 5, 7, 9] 
[10,20,8,4,5,7,9]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">dropWhile</span> (<span class="org-haskell-operator">&gt;</span>5) [10, 20, 8, 4, 5, 7, 9]
[4,5,7,9]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">dropWhile</span> (<span class="org-haskell-operator">/=</span><span class="org-string">'a'</span>) <span class="org-string">"testing a function"</span>
<span class="org-string">"a function"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
