haskell/Functions.org
*** Zip and Unzip

Zip takes two lists and returns a list of corresponding pairs. If one input list is short, excess elements of the longer list are discarded. 

#+BEGIN_SRC haskell
zip :: [a] -> [b] -> [(a, b)]
zip3 :: [a] -> [b] -> [c] -> [(a, b, c)]
#+END_SRC

Data.List

#+BEGIN_SRC haskell
zip4 :: [a] -> [b] -> [c] -> [d] -> [(a, b, c, d)]
zip5 :: [a] -> [b] -> [c] -> [d] -> [e] -> [(a, b, c, d, e)]
zip6 :: [a] -> [b] -> [c] -> [d] -> [e] -> [f] -> [(a, b, c, d, e, f)]
#+END_SRC

Unzip transforms a list of pairs into a list of first components and a list of second components. It is the inverse of zip.

#+BEGIN_SRC haskell
unzip :: [(a, b)] -> ([a], [b])
unzip3 :: [(a, b, c)] -> ([a], [b], [c])
#+END_SRC

Data.List
#+BEGIN_SRC
unzip4 :: [(a, b, c, d)] -> ([a], [b], [c], [d])
unzip5 :: [(a, b, c, d, e)] -> ([a], [b], [c], [d], [e])
unzip6 :: [(a, b, c, d, e, f)] -> ([a], [b], [c], [d], [e], [f])
#+END_SRC

Examples: Zip

#+BEGIN_SRC haskell
> zip [1, 3, 4, 5, 6] [10, 30, 40, 50, 60]
[(1,10),(3,30),(4,40),(5,50),(6,60)]
> 

> zip [1, 3, 4, 5, 6] [10, 30, 40]
[(1,10),(3,30),(4,40)]
> 

> zip [5, 6] [10, 30, 40, 50, 60]
[(5,10),(6,30)]
> 

> zip [1, 2, 3, 4, 5] ['a', 'b', 'c', 'd', 'e']
[(1,'a'),(2,'b'),(3,'c'),(4,'d'),(5,'e')]
> 

> zip ["haskell", "ocaml", "sml", "scala", "erlang"] ['a', 'b', 'c', 'd', 'e']
[("haskell",'a'),("ocaml",'b'),("sml",'c'),("scala",'d'),("erlang",'e')]
> 

> zip3 [1, 2, 3, 4, 5] ['a', 'b', 'c', 'd', 'e'] ["haskell", "ocaml", "sml", "scala", "erlang"]
[(1,'a',"haskell"),(2,'b',"ocaml"),(3,'c',"sml"),(4,'d',"scala"),(5,'e',"erlang")]
> 

> zip3 [1, 2, 3, 4, 5] ['a', 'b', 'c', 'd', 'e'] ["haskell", "ocaml", "sml", "scala"]
[(1,'a',"haskell"),(2,'b',"ocaml"),(3,'c',"sml"),(4,'d',"scala")]
> 

> zip3 [4, 5] ['a', 'b', 'c', 'd', 'e'] ["haskell", "ocaml", "sml", "scala"]
[(4,'a',"haskell"),(5,'b',"ocaml")]
> 
> 

> import Data.List
> 
> zip4 [1..5] [5..15] ['a'..'z'] (replicate 4 Nothing)
[(1,5,'a',Nothing),(2,6,'b',Nothing),(3,7,'c',Nothing),(4,8,'d',Nothing)]
> 
#+END_SRC

Example: Unzip

#+BEGIN_SRC haskell
> unzip [(1,10),(3,30),(4,40),(5,50),(6,60)]
([1,3,4,5,6],[10,30,40,50,60])
> 

> unzip [(1,'a'),(2,'b'),(3,'c'),(4,'d'),(5,'e')]
([1,2,3,4,5],"abcde")
> 

> import Data.List

> unzip3 [(1,'a',"haskell"),(2,'b',"ocaml"),(3,'c',"sml"),(4,'d',"scala")]
([1,2,3,4],"abcd",["haskell","ocaml","sml","scala"])
> 

> unzip4 [(1,5,'a',Nothing),(2,6,'b',Nothing),(3,7,'c',Nothing),(4,8,'d',Nothing)]
([1,2,3,4],[5,6,7,8],"abcd",[Nothing,Nothing,Nothing,Nothing])
> 

> let (x, y) = unzip [(1,'a'),(2,'b'),(3,'c'),(4,'d'),(5,'e')]
> x
[1,2,3,4,5]
> y
"abcde"
> 

> let (a, b, c) = unzip3 [(1,'a',"haskell"),(2,'b',"ocaml"),(3,'c',"sml"),(4,'d',"scala")]
> a
[1,2,3,4]
> b
"abcd"
> c
["haskell","ocaml","sml","scala"]
> 

#+END_SRC

