haskell/Functions.html

<div id="outline-container-sec-1-11-12" class="outline-4">
<h4 id="sec-1-11-12"><span class="section-number-4">1.11.12</span> Zip and Unzip</h4>
<div class="outline-text-4" id="text-1-11-12">
<p>
Zip takes two lists and returns a list of corresponding pairs. If one input list is short, excess elements of the longer list are discarded. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">zip</span> <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [(a, b)]
<span class="org-haskell-definition">zip3</span> <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [c] <span class="org-haskell-operator">-&gt;</span> [(a, b, c)]
</pre>
</div>

<p>
Data.List
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">zip4</span> <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [c] <span class="org-haskell-operator">-&gt;</span> [d] <span class="org-haskell-operator">-&gt;</span> [(a, b, c, d)]
<span class="org-haskell-definition">zip5</span> <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [c] <span class="org-haskell-operator">-&gt;</span> [d] <span class="org-haskell-operator">-&gt;</span> [e] <span class="org-haskell-operator">-&gt;</span> [(a, b, c, d, e)]
<span class="org-haskell-definition">zip6</span> <span class="org-haskell-operator">::</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [c] <span class="org-haskell-operator">-&gt;</span> [d] <span class="org-haskell-operator">-&gt;</span> [e] <span class="org-haskell-operator">-&gt;</span> [f] <span class="org-haskell-operator">-&gt;</span> [(a, b, c, d, e, f)]
</pre>
</div>

<p>
Unzip transforms a list of pairs into a list of first components and a list of second components. It is the inverse of zip.
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">unzip</span> <span class="org-haskell-operator">::</span> [(a, b)] <span class="org-haskell-operator">-&gt;</span> ([a], [b])
<span class="org-haskell-definition">unzip3</span> <span class="org-haskell-operator">::</span> [(a, b, c)] <span class="org-haskell-operator">-&gt;</span> ([a], [b], [c])
</pre>
</div>

<p>
Data.List
</p>
<pre class="example">
unzip4 :: [(a, b, c, d)] -&gt; ([a], [b], [c], [d])
unzip5 :: [(a, b, c, d, e)] -&gt; ([a], [b], [c], [d], [e])
unzip6 :: [(a, b, c, d, e, f)] -&gt; ([a], [b], [c], [d], [e], [f])
</pre>

<p>
Examples: Zip
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zip</span> [1, 3, 4, 5, 6] [10, 30, 40, 50, 60]
[(1,10),(3,30),(4,40),(5,50),(6,60)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zip</span> [1, 3, 4, 5, 6] [10, 30, 40]
[(1,10),(3,30),(4,40)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zip</span> [5, 6] [10, 30, 40, 50, 60]
[(5,10),(6,30)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zip</span> [1, 2, 3, 4, 5] [<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>, <span class="org-string">'d'</span>, <span class="org-string">'e'</span>]
[(1,<span class="org-string">'a'</span>),(2,<span class="org-string">'b'</span>),(3,<span class="org-string">'c'</span>),(4,<span class="org-string">'d'</span>),(5,<span class="org-string">'e'</span>)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zip</span> [<span class="org-string">"haskell"</span>, <span class="org-string">"ocaml"</span>, <span class="org-string">"sml"</span>, <span class="org-string">"scala"</span>, <span class="org-string">"erlang"</span>] [<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>, <span class="org-string">'d'</span>, <span class="org-string">'e'</span>]
[(<span class="org-string">"haskell"</span>,<span class="org-string">'a'</span>),(<span class="org-string">"ocaml"</span>,<span class="org-string">'b'</span>),(<span class="org-string">"sml"</span>,<span class="org-string">'c'</span>),(<span class="org-string">"scala"</span>,<span class="org-string">'d'</span>),(<span class="org-string">"erlang"</span>,<span class="org-string">'e'</span>)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zip3</span> [1, 2, 3, 4, 5] [<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>, <span class="org-string">'d'</span>, <span class="org-string">'e'</span>] [<span class="org-string">"haskell"</span>, <span class="org-string">"ocaml"</span>, <span class="org-string">"sml"</span>, <span class="org-string">"scala"</span>, <span class="org-string">"erlang"</span>]
[(1,<span class="org-string">'a'</span>,<span class="org-string">"haskell"</span>),(2,<span class="org-string">'b'</span>,<span class="org-string">"ocaml"</span>),(3,<span class="org-string">'c'</span>,<span class="org-string">"sml"</span>),(4,<span class="org-string">'d'</span>,<span class="org-string">"scala"</span>),(5,<span class="org-string">'e'</span>,<span class="org-string">"erlang"</span>)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zip3</span> [1, 2, 3, 4, 5] [<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>, <span class="org-string">'d'</span>, <span class="org-string">'e'</span>] [<span class="org-string">"haskell"</span>, <span class="org-string">"ocaml"</span>, <span class="org-string">"sml"</span>, <span class="org-string">"scala"</span>]
[(1,<span class="org-string">'a'</span>,<span class="org-string">"haskell"</span>),(2,<span class="org-string">'b'</span>,<span class="org-string">"ocaml"</span>),(3,<span class="org-string">'c'</span>,<span class="org-string">"sml"</span>),(4,<span class="org-string">'d'</span>,<span class="org-string">"scala"</span>)]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zip3</span> [4, 5] [<span class="org-string">'a'</span>, <span class="org-string">'b'</span>, <span class="org-string">'c'</span>, <span class="org-string">'d'</span>, <span class="org-string">'e'</span>] [<span class="org-string">"haskell"</span>, <span class="org-string">"ocaml"</span>, <span class="org-string">"sml"</span>, <span class="org-string">"scala"</span>]
[(4,<span class="org-string">'a'</span>,<span class="org-string">"haskell"</span>),(5,<span class="org-string">'b'</span>,<span class="org-string">"ocaml"</span>)]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.List</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zip4</span> [1<span class="org-haskell-operator">..</span>5] [5<span class="org-haskell-operator">..</span>15] [<span class="org-string">'a'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>] (replicate 4 <span class="org-haskell-constructor">Nothing</span>)
[(1,5,<span class="org-string">'a'</span>,<span class="org-haskell-constructor">Nothing</span>),(2,6,<span class="org-string">'b'</span>,<span class="org-haskell-constructor">Nothing</span>),(3,7,<span class="org-string">'c'</span>,<span class="org-haskell-constructor">Nothing</span>),(4,8,<span class="org-string">'d'</span>,<span class="org-haskell-constructor">Nothing</span>)]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
Example: Unzip
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">unzip</span> [(1,10),(3,30),(4,40),(5,50),(6,60)]
([1,3,4,5,6],[10,30,40,50,60])
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">unzip</span> [(1,<span class="org-string">'a'</span>),(2,<span class="org-string">'b'</span>),(3,<span class="org-string">'c'</span>),(4,<span class="org-string">'d'</span>),(5,<span class="org-string">'e'</span>)]
([1,2,3,4,5],<span class="org-string">"abcde"</span>)
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.List</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">unzip3</span> [(1,<span class="org-string">'a'</span>,<span class="org-string">"haskell"</span>),(2,<span class="org-string">'b'</span>,<span class="org-string">"ocaml"</span>),(3,<span class="org-string">'c'</span>,<span class="org-string">"sml"</span>),(4,<span class="org-string">'d'</span>,<span class="org-string">"scala"</span>)]
([1,2,3,4],<span class="org-string">"abcd"</span>,[<span class="org-string">"haskell"</span>,<span class="org-string">"ocaml"</span>,<span class="org-string">"sml"</span>,<span class="org-string">"scala"</span>])
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">unzip4</span> [(1,5,<span class="org-string">'a'</span>,<span class="org-haskell-constructor">Nothing</span>),(2,6,<span class="org-string">'b'</span>,<span class="org-haskell-constructor">Nothing</span>),(3,7,<span class="org-string">'c'</span>,<span class="org-haskell-constructor">Nothing</span>),(4,8,<span class="org-string">'d'</span>,<span class="org-haskell-constructor">Nothing</span>)]
([1,2,3,4],[5,6,7,8],<span class="org-string">"abcd"</span>,[<span class="org-haskell-constructor">Nothing</span>,<span class="org-haskell-constructor">Nothing</span>,<span class="org-haskell-constructor">Nothing</span>,<span class="org-haskell-constructor">Nothing</span>])
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> (x, y) <span class="org-haskell-operator">=</span> unzip [(1,<span class="org-string">'a'</span>),(2,<span class="org-string">'b'</span>),(3,<span class="org-string">'c'</span>),(4,<span class="org-string">'d'</span>),(5,<span class="org-string">'e'</span>)]
<span class="org-haskell-operator">&gt;</span> x
[1,2,3,4,5]
<span class="org-haskell-operator">&gt;</span> y
<span class="org-string">"abcde"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> (a, b, c) <span class="org-haskell-operator">=</span> unzip3 [(1,<span class="org-string">'a'</span>,<span class="org-string">"haskell"</span>),(2,<span class="org-string">'b'</span>,<span class="org-string">"ocaml"</span>),(3,<span class="org-string">'c'</span>,<span class="org-string">"sml"</span>),(4,<span class="org-string">'d'</span>,<span class="org-string">"scala"</span>)]
<span class="org-haskell-operator">&gt;</span> a
[1,2,3,4]
<span class="org-haskell-operator">&gt;</span> b
<span class="org-string">"abcd"</span>
<span class="org-haskell-operator">&gt;</span> c
[<span class="org-string">"haskell"</span>,<span class="org-string">"ocaml"</span>,<span class="org-string">"sml"</span>,<span class="org-string">"scala"</span>]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
