haskell/Functions.org
*** ZipWith 

ZipWith function applies a function of two arguments to each elements of two given lists returning a new list.

Defined in Prelude

#+BEGIN_SRC haskell
zipWith :: (a -> b -> c) -> [a] -> [b] -> [c]
zipWith3 :: (a -> b -> c -> d) -> [a] -> [b] -> [c] -> [d]
#+END_SRC

Defined in Data.List

#+BEGIN_SRC haskell
import Data.List
zipWith4   :: (a -> b -> c -> d -> e) -> [a] -> [b] -> [c] -> [d] -> [e]
zipWith5   :: (a -> b -> c -> d -> e -> f) -> [a] -> [b] -> [c] -> [d] -> [e] -> [f]
zipWith7   :: (a -> b -> c -> d -> e -> f -> g -> h) -> [a] -> [b] -> [c] -> [d] -> [e] -> [f] -> [g] -> [h]
#+END_SRC

Examples:

#+BEGIN_SRC haskell

{- 

ZipWith takes a function of two arguments and two lists 
returning a new one

    ->  (a -> b -> c)   : Function of two arguments returning type c
    ->  [a]            :  List of type a
    ->  [b]            :  List of type b
    
    Returns 
    ->  [c]            :  List of type c
-}
> :t zipWith
zipWith :: (a -> b -> c) -> [a] -> [b] -> [c]
> 

> :t (+)
(+) :: Num a => a -> a -> a
> 


{- Add each element of two lists -}
> zipWith (+) [1, 2, 3, 4] [9, 10, 3, 5]
[10,12,6,9]
> 
> 

{- Multiply each element of two lists-}
> zipWith (*) [1, 2, 3, 4] [9, 10, 3, 5]
[9,20,9,20]
> 

{- Subtract each element of two lists -}
> zipWith (-) [1, 2, 3, 4] [9, 10, 3, 5]
[-8,-8,0,-1]
> 

{- zipWith with anonymous functions -}

> zipWith (\x y -> 10*x + 4*y) [10, 20, 30] [3, 4, 5]
[112,216,320]
> 
> let f = zipWith (\x y -> 10*x + 4*y)
> 
> f [10, 20, 30] [3, 4, 5]
[112,216,320]
> 


{- New functions can be created by curring arguments -}

> let addVectors = zipWith (+)
> let subVectors = zipWith (-)
> let mulVectors = zipWith (*)
> 
> :t addVectors 
addVectors :: [Integer] -> [Integer] -> [Integer]
> :t subVectors 
subVectors :: [Integer] -> [Integer] -> [Integer]
> :t mulVectors 
mulVectors :: [Integer] -> [Integer] -> [Integer]
> 

> addVectors [1, 2, 3, 4] [9, 10, 3, 5]
[10,12,6,9]
> 
> subVectors [1, 2, 3, 4] [9, 10, 3, 5]
[-8,-8,0,-1]
> mulVectors [1, 2, 3, 4] [9, 10, 3, 5]
[9,20,9,20]
> 

{- Using Functions as operators -}

> [1, 2, 3, 4]  `addVectors` [9, 10, 3, 5]
[10,12,6,9]
> 
> 
> [1, 2, 3, 4]  `subVectors` [9, 10, 3, 5]
[-8,-8,0,-1]
> 
> [1, 2, 3, 4]  `mulVectors` [9, 10, 3, 5]
[9,20,9,20]
> 

> let f x y z = x*y*z 

> zipWith3 f [1, 3, 4, 8] [4, 5, 9] [8, 7, 3]
[32,105,108]
> 
> let zf = zipWith3 f
> 
> zf [1, 3, 4, 8] [4, 5, 9] [8, 7, 3]
[32,105,108]
> 

> import Data.List
> 
> zipWith4 g [12, 34, 1, 4] [8, 19, 33, 23] [5, 7, 8, 9] [33, 78, 17, 14]
[337,2371,-1277,-929]
> 

> let g1 = zipWith4 g [12, 34, 1, 4] 
> g1 [8, 19, 33, 23] [5, 7, 8, 9] [33, 78, 17, 14]
[337,2371,-1277,-929]

> let g2 = g1 [8, 19, 33, 23]
> g2 [5, 7, 8, 9] [33, 78, 17, 14]
[337,2371,-1277,-929]

> let g3 = g2 [5, 7, 8, 9]
> g3  [33, 78, 17, 14]
[337,2371,-1277,-929]

> let g4 = g3 [33, 78, 17, 14]
> g4
[337,2371,-1277,-929]
> 

#+END_SRC

