haskell/Functions.html

<div id="outline-container-sec-1-11-13" class="outline-4">
<h4 id="sec-1-11-13"><span class="section-number-4">1.11.13</span> ZipWith</h4>
<div class="outline-text-4" id="text-1-11-13">
<p>
ZipWith function applies a function of two arguments to each elements of two given lists returning a new list.
</p>

<p>
Defined in Prelude
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-definition">zipWith</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [c]
<span class="org-haskell-definition">zipWith3</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c <span class="org-haskell-operator">-&gt;</span> d) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [c] <span class="org-haskell-operator">-&gt;</span> [d]
</pre>
</div>

<p>
Defined in Data.List
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.List</span>
<span class="org-haskell-definition">zipWith4</span>   <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c <span class="org-haskell-operator">-&gt;</span> d <span class="org-haskell-operator">-&gt;</span> e) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [c] <span class="org-haskell-operator">-&gt;</span> [d] <span class="org-haskell-operator">-&gt;</span> [e]
<span class="org-haskell-definition">zipWith5</span>   <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c <span class="org-haskell-operator">-&gt;</span> d <span class="org-haskell-operator">-&gt;</span> e <span class="org-haskell-operator">-&gt;</span> f) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [c] <span class="org-haskell-operator">-&gt;</span> [d] <span class="org-haskell-operator">-&gt;</span> [e] <span class="org-haskell-operator">-&gt;</span> [f]
<span class="org-haskell-definition">zipWith7</span>   <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c <span class="org-haskell-operator">-&gt;</span> d <span class="org-haskell-operator">-&gt;</span> e <span class="org-haskell-operator">-&gt;</span> f <span class="org-haskell-operator">-&gt;</span> g <span class="org-haskell-operator">-&gt;</span> h) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [c] <span class="org-haskell-operator">-&gt;</span> [d] <span class="org-haskell-operator">-&gt;</span> [e] <span class="org-haskell-operator">-&gt;</span> [f] <span class="org-haskell-operator">-&gt;</span> [g] <span class="org-haskell-operator">-&gt;</span> [h]
</pre>
</div>

<p>
Examples:
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-comment-delimiter">{- </span>

<span class="org-comment">ZipWith takes a function of two arguments and two lists </span>
<span class="org-comment">returning a new one</span>

<span class="org-comment">    -&gt;  (a -&gt; b -&gt; c)   : Function of two arguments returning type c</span>
<span class="org-comment">    -&gt;  [a]            :  List of type a</span>
<span class="org-comment">    -&gt;  [b]            :  List of type b</span>

<span class="org-comment">    Returns </span>
<span class="org-comment">    -&gt;  [c]            :  List of type c</span>
<span class="org-comment">-}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t zipWith
<span class="org-haskell-definition">zipWith</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> b <span class="org-haskell-operator">-&gt;</span> c) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> [b] <span class="org-haskell-operator">-&gt;</span> [c]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t (<span class="org-haskell-operator">+</span>)
(<span class="org-haskell-definition">+</span>) <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Num</span> a <span class="org-haskell-operator">=&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> a
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">Add each element of two lists -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zipWith</span> (<span class="org-haskell-operator">+</span>) [1, 2, 3, 4] [9, 10, 3, 5]
[10,12,6,9]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Multiply each element of two lists-}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zipWith</span> (<span class="org-haskell-operator">*</span>) [1, 2, 3, 4] [9, 10, 3, 5]
[9,20,9,20]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Subtract each element of two lists -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zipWith</span> (<span class="org-haskell-operator">-</span>) [1, 2, 3, 4] [9, 10, 3, 5]
[<span class="org-haskell-operator">-</span>8,<span class="org-haskell-operator">-</span>8,0,<span class="org-haskell-operator">-</span>1]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">zipWith with anonymous functions -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zipWith</span> (<span class="org-haskell-operator">\</span>x y <span class="org-haskell-operator">-&gt;</span> 10<span class="org-haskell-operator">*</span>x <span class="org-haskell-operator">+</span> 4<span class="org-haskell-operator">*</span>y) [10, 20, 30] [3, 4, 5]
[112,216,320]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f <span class="org-haskell-operator">=</span> zipWith (<span class="org-haskell-operator">\</span>x y <span class="org-haskell-operator">-&gt;</span> 10<span class="org-haskell-operator">*</span>x <span class="org-haskell-operator">+</span> 4<span class="org-haskell-operator">*</span>y)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">f</span> [10, 20, 30] [3, 4, 5]
[112,216,320]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">New functions can be created by curring arguments -}</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> addVectors <span class="org-haskell-operator">=</span> zipWith (<span class="org-haskell-operator">+</span>)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> subVectors <span class="org-haskell-operator">=</span> zipWith (<span class="org-haskell-operator">-</span>)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> mulVectors <span class="org-haskell-operator">=</span> zipWith (<span class="org-haskell-operator">*</span>)
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t addVectors 
<span class="org-haskell-definition">addVectors</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Integer</span>] <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">Integer</span>] <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">Integer</span>]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t subVectors 
<span class="org-haskell-definition">subVectors</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Integer</span>] <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">Integer</span>] <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">Integer</span>]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-type">:</span>t mulVectors 
<span class="org-haskell-definition">mulVectors</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Integer</span>] <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">Integer</span>] <span class="org-haskell-operator">-&gt;</span> [<span class="org-haskell-type">Integer</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">addVectors</span> [1, 2, 3, 4] [9, 10, 3, 5]
[10,12,6,9]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">subVectors</span> [1, 2, 3, 4] [9, 10, 3, 5]
[<span class="org-haskell-operator">-</span>8,<span class="org-haskell-operator">-</span>8,0,<span class="org-haskell-operator">-</span>1]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">mulVectors</span> [1, 2, 3, 4] [9, 10, 3, 5]
[9,20,9,20]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Using Functions as operators -}</span>

<span class="org-haskell-operator">&gt;</span> [1, 2, 3, 4]  <span class="org-haskell-operator">`addVectors`</span> [9, 10, 3, 5]
[10,12,6,9]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> [1, 2, 3, 4]  <span class="org-haskell-operator">`subVectors`</span> [9, 10, 3, 5]
[<span class="org-haskell-operator">-</span>8,<span class="org-haskell-operator">-</span>8,0,<span class="org-haskell-operator">-</span>1]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> [1, 2, 3, 4]  <span class="org-haskell-operator">`mulVectors`</span> [9, 10, 3, 5]
[9,20,9,20]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f x y z <span class="org-haskell-operator">=</span> x<span class="org-haskell-operator">*</span>y<span class="org-haskell-operator">*</span>z 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zipWith3</span> f [1, 3, 4, 8] [4, 5, 9] [8, 7, 3]
[32,105,108]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> zf <span class="org-haskell-operator">=</span> zipWith3 f
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zf</span> [1, 3, 4, 8] [4, 5, 9] [8, 7, 3]
[32,105,108]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.List</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zipWith4</span> g [12, 34, 1, 4] [8, 19, 33, 23] [5, 7, 8, 9] [33, 78, 17, 14]
[337,2371,<span class="org-haskell-operator">-</span>1277,<span class="org-haskell-operator">-</span>929]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> g1 <span class="org-haskell-operator">=</span> zipWith4 g [12, 34, 1, 4] 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">g1</span> [8, 19, 33, 23] [5, 7, 8, 9] [33, 78, 17, 14]
[337,2371,<span class="org-haskell-operator">-</span>1277,<span class="org-haskell-operator">-</span>929]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> g2 <span class="org-haskell-operator">=</span> g1 [8, 19, 33, 23]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">g2</span> [5, 7, 8, 9] [33, 78, 17, 14]
[337,2371,<span class="org-haskell-operator">-</span>1277,<span class="org-haskell-operator">-</span>929]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> g3 <span class="org-haskell-operator">=</span> g2 [5, 7, 8, 9]
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">g3</span>  [33, 78, 17, 14]
[337,2371,<span class="org-haskell-operator">-</span>1277,<span class="org-haskell-operator">-</span>929]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> g4 <span class="org-haskell-operator">=</span> g3 [33, 78, 17, 14]
<span class="org-haskell-operator">&gt;</span> g4
[337,2371,<span class="org-haskell-operator">-</span>1277,<span class="org-haskell-operator">-</span>929]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
