haskell/Functions.org
*** Replicate

Replicate an element of type a n times.
#+BEGIN_SRC
replicate :: Int -> a -> [a]
#+END_SRC

Example:
#+BEGIN_SRC haskell
> :t replicate 
replicate :: Int -> a -> [a]
> 

> replicate 4 'a'
"aaaa"
> replicate 6 2.345
[2.345,2.345,2.345,2.345,2.345,2.345]
> 

{- You can also replicate functions -}
> let f = replicate 3 (+1)
> :t f
f :: [Integer -> Integer]
> 
> map ($ 5) f
[6,6,6]
> 

> replicate 3 (Just 5)
[Just 5,Just 5,Just 5]
> 
> replicate 3 Nothing
[Nothing,Nothing,Nothing]
> 

#+END_SRC

*** Other Useful higher-order functions

The standard Prelude defines scores of useful functions, many of which enjoy great generality due to the abstractional capabilities of polymorphic 
types and higher-order functions [[http://www.willamette.edu/~fruehr/haskell/lectures/tutorial4.html#@sli@31][[Programming in Haskell 3rd CCSC Northwest Conference • Fall 2001]]]


#+BEGIN_SRC haskell
> zipWith (*) [1..10] [1..10]
[1,4,9,16,25,36,49,64,81,100]

> :t replicate
replicate :: Int -> a -> [a]

> zipWith replicate [1..6] ['a'..'z']
["a","bb","ccc","dddd","eeeee","ffffff"]

> takeWhile (<100) [ 2^n | n<-[1..] ]
[2,4,8,16,32,64]

> :t takeWhile
takeWhile :: (a -> Bool) -> [a] -> [a]
#+END_SRC

** Functions to Manipulate Characters and Strings
*** Strings Features

*Strings as List of Characters*

#+BEGIN_SRC
> 
> ['(', ')', '!', 'a', 'b', 'c', '0', '1']
"()!abc01"
> 
#+END_SRC


*Character Sequences*

#+BEGIN_SRC haskell
> ['a'..'z']
"abcdefghijklmnopqrstuvwxyz"

> ['A'..'Z']
"ABCDEFGHIJKLMNOPQRSTUVWXYZ"

> ['0'..'9']
"0123456789"
> 

> ['0'..'z']
"0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz"

#+END_SRC

*Add a character to a string*

#+BEGIN_SRC haskell

> "adding " ++ "three" ++ " strings"
"adding three strings"
> 

> "Hello world " ++ ['1']
"Hello world 1"
> 

> 'x' : "Hello World"
"xHello World"
> 
> 'y' : 'x' : "Hello World"
"yxHello World"
> 

#+END_SRC

