haskell/Functions.html

<div id="outline-container-sec-1-11-14" class="outline-4">
<h4 id="sec-1-11-14"><span class="section-number-4">1.11.14</span> Replicate</h4>
<div class="outline-text-4" id="text-1-11-14">
<p>
Replicate an element of type a n times.
</p>
<pre class="example">
replicate :: Int -&gt; a -&gt; [a]
</pre>

<p>
Example:
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t replicate 
<span class="org-haskell-definition">replicate</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> [a]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicate</span> 4 <span class="org-string">'a'</span>
<span class="org-string">"aaaa"</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicate</span> 6 2.345
[2.345,2.345,2.345,2.345,2.345,2.345]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">You can also replicate functions -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> f <span class="org-haskell-operator">=</span> replicate 3 (<span class="org-haskell-operator">+</span>1)
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t f
<span class="org-haskell-definition">f</span> <span class="org-haskell-operator">::</span> [<span class="org-haskell-type">Integer</span> <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Integer</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">$</span> 5) f
[6,6,6]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicate</span> 3 (<span class="org-haskell-constructor">Just</span> 5)
[<span class="org-haskell-constructor">Just</span> 5,<span class="org-haskell-constructor">Just</span> 5,<span class="org-haskell-constructor">Just</span> 5]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">replicate</span> 3 <span class="org-haskell-constructor">Nothing</span>
[<span class="org-haskell-constructor">Nothing</span>,<span class="org-haskell-constructor">Nothing</span>,<span class="org-haskell-constructor">Nothing</span>]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-11-15" class="outline-4">
<h4 id="sec-1-11-15"><span class="section-number-4">1.11.15</span> Other Useful higher-order functions</h4>
<div class="outline-text-4" id="text-1-11-15">
<p>
The standard Prelude defines scores of useful functions, many of which enjoy great generality due to the abstractional capabilities of polymorphic 
types and higher-order functions [[<a href="http://www.willamette.edu/~fruehr/haskell/lectures/tutorial4.html#@sli@31][[Programming">http://www.willamette.edu/~fruehr/haskell/lectures/tutorial4.html#@sli@31][[Programming</a> in Haskell 3rd CCSC Northwest Conference  Fall 2001]]]
</p>


<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zipWith</span> (<span class="org-haskell-operator">*</span>) [1<span class="org-haskell-operator">..</span>10] [1<span class="org-haskell-operator">..</span>10]
[1,4,9,16,25,36,49,64,81,100]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t replicate
<span class="org-haskell-definition">replicate</span> <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Int</span> <span class="org-haskell-operator">-&gt;</span> a <span class="org-haskell-operator">-&gt;</span> [a]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">zipWith</span> replicate [1<span class="org-haskell-operator">..</span>6] [<span class="org-string">'a'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
[<span class="org-string">"a"</span>,<span class="org-string">"bb"</span>,<span class="org-string">"ccc"</span>,<span class="org-string">"dddd"</span>,<span class="org-string">"eeeee"</span>,<span class="org-string">"ffffff"</span>]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">takeWhile</span> (<span class="org-haskell-operator">&lt;</span>100) [ 2<span class="org-haskell-operator">^</span>n <span class="org-haskell-operator">|</span> n<span class="org-haskell-operator">&lt;-</span>[1<span class="org-haskell-operator">..</span>] ]
[2,4,8,16,32,64]

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-constructor">:</span>t takeWhile
<span class="org-haskell-definition">takeWhile</span> <span class="org-haskell-operator">::</span> (a <span class="org-haskell-operator">-&gt;</span> <span class="org-haskell-type">Bool</span>) <span class="org-haskell-operator">-&gt;</span> [a] <span class="org-haskell-operator">-&gt;</span> [a]
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> Functions to Manipulate Characters and Strings</h3>
<div class="outline-text-3" id="text-1-12">
</div><div id="outline-container-sec-1-12-1" class="outline-4">
<h4 id="sec-1-12-1"><span class="section-number-4">1.12.1</span> Strings Features</h4>
<div class="outline-text-4" id="text-1-12-1">
<p>
<b>Strings as List of Characters</b>
</p>

<pre class="example">
&gt; 
&gt; ['(', ')', '!', 'a', 'b', 'c', '0', '1']
"()!abc01"
&gt;
</pre>


<p>
<b>Character Sequences</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> [<span class="org-string">'a'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
<span class="org-string">"abcdefghijklmnopqrstuvwxyz"</span>

<span class="org-haskell-operator">&gt;</span> [<span class="org-string">'A'</span><span class="org-haskell-operator">..</span><span class="org-string">'Z'</span>]
<span class="org-string">"ABCDEFGHIJKLMNOPQRSTUVWXYZ"</span>

<span class="org-haskell-operator">&gt;</span> [<span class="org-string">'0'</span><span class="org-haskell-operator">..</span><span class="org-string">'9'</span>]
<span class="org-string">"0123456789"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> [<span class="org-string">'0'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
<span class="org-string">"0123456789:;&lt;=&gt;?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz"</span>
</pre>
</div>

<p>
<b>Add a character to a string</b>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-string">"adding "</span> <span class="org-haskell-operator">++</span> <span class="org-string">"three"</span> <span class="org-haskell-operator">++</span> <span class="org-string">" strings"</span>
<span class="org-string">"adding three strings"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-string">"Hello world "</span> <span class="org-haskell-operator">++</span> [<span class="org-string">'1'</span>]
<span class="org-string">"Hello world 1"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-string">'x'</span> <span class="org-haskell-constructor">:</span> <span class="org-string">"Hello World"</span>
<span class="org-string">"xHello World"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-string">'y'</span> <span class="org-haskell-constructor">:</span> <span class="org-string">'x'</span> <span class="org-haskell-constructor">:</span> <span class="org-string">"Hello World"</span>
<span class="org-string">"yxHello World"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
