haskell/Functions.org
*** Prelude String Functions

*lines*

Lines breaks a string up into a list of strings at newline characters. The resulting strings do not contain newlines.


#+BEGIN_SRC
lines :: String -> [String] 
#+END_SRC

#+BEGIN_SRC haskell
> let text = "Hello World\nHaskell\n Is very Cool"
> text
"Hello World\nHaskell\n Is very Cool"


> putStrLn text
Hello World
Haskell
 Is very Cool
> 
> 

> lines text
["Hello World","Haskell"," Is very Cool"]
> 
#+END_SRC

*unlines*

Unlines is an inverse operation to lines. It joins lines, after appending a terminating newline to each.

#+BEGIN_SRC
unlines :: [String] -> String 
#+END_SRC

#+BEGIN_SRC haskell
> unlines ["Hello World","Haskell"," Is very Cool"]
"Hello World\nHaskell\n Is very Cool\n"
> 
> putStrLn $ unlines ["Hello World","Haskell"," Is very Cool"]
Hello World
Haskell
 Is very Cool

>
#+END_SRC

*words*

Words breaks a string up into a list of words, which were delimited by white space.

#+BEGIN_SRC
words :: String -> [String] 
#+END_SRC

#+BEGIN_SRC haskell
> words "Hello world haskell 123 2312 --- "
["Hello","world","haskell","123","2312","---"]
> 
#+END_SRC

*unwords*

unwords is an inverse operation to words. It joins words with separating spaces.

#+BEGIN_SRC
unwords :: [String] -> String 
#+END_SRC

#+BEGIN_SRC haskell
> unwords ["Hello","world","haskell","123","2312","---"]
"Hello world haskell 123 2312 ---"
> 
#+END_SRC

*reverse*

Reverse a string. 

#+BEGIN_SRC haskell
> reverse "lleksaH dlroW olleH"
"Hello World Haskell"
> 
#+END_SRC

*** Data.Char String Functions

Documentation: https://hackage.haskell.org/package/base-4.2.0.1/docs/Data-Char.html

#+BEGIN_SRC haskell
import Data.Char

> ['0'..'z']
"0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz"
> 

> filter isDigit  ['0'..'z']
"0123456789"
> 

> filter isAlpha ['0'..'z']
"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"
> 

> filter isLower ['0'..'z']
"abcdefghijklmnopqrstuvwxyz"
> 
> filter isUpper ['0'..'z']
"ABCDEFGHIJKLMNOPQRSTUVWXYZ"
> 
> 

> filter isHexDigit ['0'..'z']
"0123456789ABCDEFabcdef"
> 

> filter isAlphaNum ['0'..'z']
"0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"
> 

> map toUpper ['a'..'z']
"ABCDEFGHIJKLMNOPQRSTUVWXYZ"
>

> map toLower ['A'..'Z']
"abcdefghijklmnopqrstuvwxyz"
> 

{- Convert to ascii decimal number -}
> map ord ['a'..'f']
[97,98,99,100,101,102]
> 


{- Convert ascii to char -}
> map chr [97,98,99,100,101,102]
"abcdef"
> 
#+END_SRC

*** Data.List.Split String Functions

The Data.List.Split module contains a wide range of strategies for splitting lists with respect to some sort of delimiter, mostly implemented through a unified combinator interface. The goal is to be flexible yet simple.

Documentation: http://hackage.haskell.org/package/split-0.1.4.1/docs/Data-List-Split.html

#+BEGIN_SRC haskell
> import Data.List.Split
> 

> splitOn "," "1232,2323.232,323.434"
["1232","2323.232","323.434"]
> 
> 

> map (\s -> read s :: Double) $ splitOn "," "1232,2323.232,323.434"
[1232.0,2323.232,323.434]
> 
> 

> endBy "," "1232,2323.232,323.434,"
["1232","2323.232","323.434"]
> 
> 

>  splitOneOf ";.," "foo,bar;baz.glurk"
["foo","bar","baz","glurk"]
> 

> chunksOf  3 ['a'..'z']
["abc","def","ghi","jkl","mno","pqr","stu","vwx","yz"]
> 
> 

#+END_SRC
