haskell/Functions.html

<div id="outline-container-sec-1-12-2" class="outline-4">
<h4 id="sec-1-12-2"><span class="section-number-4">1.12.2</span> Prelude String Functions</h4>
<div class="outline-text-4" id="text-1-12-2">
<p>
<b>lines</b>
</p>

<p>
Lines breaks a string up into a list of strings at newline characters. The resulting strings do not contain newlines.
</p>


<pre class="example">
lines :: String -&gt; [String]
</pre>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">let</span> text <span class="org-haskell-operator">=</span> <span class="org-string">"Hello World\nHaskell\n Is very Cool"</span>
<span class="org-haskell-operator">&gt;</span> text
<span class="org-string">"Hello World\nHaskell\n Is very Cool"</span>


<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">putStrLn</span> text
<span class="org-haskell-constructor">Hello</span> <span class="org-haskell-constructor">World</span>
<span class="org-haskell-constructor">Haskell</span>
 <span class="org-haskell-constructor">Is</span> very <span class="org-haskell-constructor">Cool</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">lines</span> text
[<span class="org-string">"Hello World"</span>,<span class="org-string">"Haskell"</span>,<span class="org-string">" Is very Cool"</span>]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>unlines</b>
</p>

<p>
Unlines is an inverse operation to lines. It joins lines, after appending a terminating newline to each.
</p>

<pre class="example">
unlines :: [String] -&gt; String
</pre>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">unlines</span> [<span class="org-string">"Hello World"</span>,<span class="org-string">"Haskell"</span>,<span class="org-string">" Is very Cool"</span>]
<span class="org-string">"Hello World\nHaskell\n Is very Cool\n"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> putStrLn <span class="org-haskell-definition">$</span> unlines [<span class="org-string">"Hello World"</span>,<span class="org-string">"Haskell"</span>,<span class="org-string">" Is very Cool"</span>]
<span class="org-haskell-constructor">Hello</span> <span class="org-haskell-constructor">World</span>
<span class="org-haskell-constructor">Haskell</span>
 <span class="org-haskell-constructor">Is</span> very <span class="org-haskell-constructor">Cool</span>

<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>words</b>
</p>

<p>
Words breaks a string up into a list of words, which were delimited by white space.
</p>

<pre class="example">
words :: String -&gt; [String]
</pre>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">words</span> <span class="org-string">"Hello world haskell 123 2312 --- "</span>
[<span class="org-string">"Hello"</span>,<span class="org-string">"world"</span>,<span class="org-string">"haskell"</span>,<span class="org-string">"123"</span>,<span class="org-string">"2312"</span>,<span class="org-string">"---"</span>]
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>unwords</b>
</p>

<p>
unwords is an inverse operation to words. It joins words with separating spaces.
</p>

<pre class="example">
unwords :: [String] -&gt; String
</pre>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">unwords</span> [<span class="org-string">"Hello"</span>,<span class="org-string">"world"</span>,<span class="org-string">"haskell"</span>,<span class="org-string">"123"</span>,<span class="org-string">"2312"</span>,<span class="org-string">"---"</span>]
<span class="org-string">"Hello world haskell 123 2312 ---"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>

<p>
<b>reverse</b>
</p>

<p>
Reverse a string. 
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">reverse</span> <span class="org-string">"lleksaH dlroW olleH"</span>
<span class="org-string">"Hello World Haskell"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-12-3" class="outline-4">
<h4 id="sec-1-12-3"><span class="section-number-4">1.12.3</span> Data.Char String Functions</h4>
<div class="outline-text-4" id="text-1-12-3">
<p>
Documentation: <a href="https://hackage.haskell.org/package/base-4.2.0.1/docs/Data-Char.html">https://hackage.haskell.org/package/base-4.2.0.1/docs/Data-Char.html</a>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.Char</span>

<span class="org-haskell-operator">&gt;</span> [<span class="org-string">'0'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
<span class="org-string">"0123456789:;&lt;=&gt;?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> isDigit  [<span class="org-string">'0'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
<span class="org-string">"0123456789"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> isAlpha [<span class="org-string">'0'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
<span class="org-string">"ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> isLower [<span class="org-string">'0'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
<span class="org-string">"abcdefghijklmnopqrstuvwxyz"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> isUpper [<span class="org-string">'0'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
<span class="org-string">"ABCDEFGHIJKLMNOPQRSTUVWXYZ"</span>
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> isHexDigit [<span class="org-string">'0'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
<span class="org-string">"0123456789ABCDEFabcdef"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">filter</span> isAlphaNum [<span class="org-string">'0'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
<span class="org-string">"0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> toUpper [<span class="org-string">'a'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
<span class="org-string">"ABCDEFGHIJKLMNOPQRSTUVWXYZ"</span>
<span class="org-haskell-operator">&gt;</span>

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> toLower [<span class="org-string">'A'</span><span class="org-haskell-operator">..</span><span class="org-string">'Z'</span>]
<span class="org-string">"abcdefghijklmnopqrstuvwxyz"</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-comment-delimiter">{- </span><span class="org-comment">Convert to ascii decimal number -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> ord [<span class="org-string">'a'</span><span class="org-haskell-operator">..</span><span class="org-string">'f'</span>]
[97,98,99,100,101,102]
<span class="org-haskell-operator">&gt;</span> 


<span class="org-comment-delimiter">{- </span><span class="org-comment">Convert ascii to char -}</span>
<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> chr [97,98,99,100,101,102]
<span class="org-string">"abcdef"</span>
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-12-4" class="outline-4">
<h4 id="sec-1-12-4"><span class="section-number-4">1.12.4</span> Data.List.Split String Functions</h4>
<div class="outline-text-4" id="text-1-12-4">
<p>
The Data.List.Split module contains a wide range of strategies for splitting lists with respect to some sort of delimiter, mostly implemented through a unified combinator interface. The goal is to be flexible yet simple.
</p>

<p>
Documentation: <a href="http://hackage.haskell.org/package/split-0.1.4.1/docs/Data-List-Split.html">http://hackage.haskell.org/package/split-0.1.4.1/docs/Data-List-Split.html</a>
</p>

<div class="org-src-container">

<pre class="src src-haskell"><span class="org-haskell-operator">&gt;</span> <span class="org-haskell-keyword">import</span> <span class="org-haskell-constructor">Data.List.Split</span>
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">splitOn</span> <span class="org-string">","</span> <span class="org-string">"1232,2323.232,323.434"</span>
[<span class="org-string">"1232"</span>,<span class="org-string">"2323.232"</span>,<span class="org-string">"323.434"</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">map</span> (<span class="org-haskell-operator">\</span>s <span class="org-haskell-operator">-&gt;</span> read s <span class="org-haskell-operator">::</span> <span class="org-haskell-type">Double</span>) <span class="org-haskell-operator">$</span> splitOn <span class="org-string">","</span> <span class="org-string">"1232,2323.232,323.434"</span>
[1232.0,2323.232,323.434]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">endBy</span> <span class="org-string">","</span> <span class="org-string">"1232,2323.232,323.434,"</span>
[<span class="org-string">"1232"</span>,<span class="org-string">"2323.232"</span>,<span class="org-string">"323.434"</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span>  splitOneOf <span class="org-string">";.,"</span> <span class="org-string">"foo,bar;baz.glurk"</span>
[<span class="org-string">"foo"</span>,<span class="org-string">"bar"</span>,<span class="org-string">"baz"</span>,<span class="org-string">"glurk"</span>]
<span class="org-haskell-operator">&gt;</span> 

<span class="org-haskell-operator">&gt;</span> <span class="org-haskell-definition">chunksOf</span>  3 [<span class="org-string">'a'</span><span class="org-haskell-operator">..</span><span class="org-string">'z'</span>]
[<span class="org-string">"abc"</span>,<span class="org-string">"def"</span>,<span class="org-string">"ghi"</span>,<span class="org-string">"jkl"</span>,<span class="org-string">"mno"</span>,<span class="org-string">"pqr"</span>,<span class="org-string">"stu"</span>,<span class="org-string">"vwx"</span>,<span class="org-string">"yz"</span>]
<span class="org-haskell-operator">&gt;</span> 
<span class="org-haskell-operator">&gt;</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Caio Rodrigues</p>
<p class="date">Created: 2017-03-06 seg 12:33</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>